/**
 * Sample React Native App
 * https://github.com/facebook/react-native
 *
 * @format
 * @flow
 */

import React from 'react';
import {
  SafeAreaView,
  StyleSheet,
  ScrollView,
  View,
  Text,
  StatusBar,
  TextInput,
} from 'react-native';
import GestureRecognizer, {swipeDirections} from 'react-native-swipe-gestures';
import {Dimensions } from "react-native";
import { Container, Header, Title, Content, Footer, FooterTab, Button, Left, Right, Body, Icon} from 'native-base';

class App extends React.Component {
  constructor()
  {
    super();

    this.state = {
      books:[
        {"پیش لفظ":[{"":" نحمد ہ ونصلی علیٰ رسولہ الکریم وعلیٰ آلہ الطیبین الطاہرین ۔ اما بعد ۔ کائنات عالم میں ہر چیز فانی ہیں، باقی رہنے والی ذات صرف اللہ تعالیٰ کی ہیں۔ اس فانی دنیا میں اللہ تعالیٰ نے انسان کو اشرف المخلوقات ہونے کا شرف بخشا اور انسان کو ایک اصول اور ضابطۂ حیات عطا فرمایا جس کو وحی کے ذریعے پیغمبروں تک پہنچایا ۔ پیغمبروں نے تبلیغ کے ذریعے انسانوں تک پہنچایا، اس ضابطۂ حیات کو دین کی اصطلاح میں’’ شریعت‘‘ کہتے ہیں۔ شریعت میں انسانوں کے مرنے کے بعد کچھ احکامات مقرر ہیں۔ ان احکامات کو پورا کرنا ہر فرد مسلم کے لئے لازمی ہے۔ زیر نظر کتابچہ انہی احکامات کو سلیس، آسان اور عام فہم لفظوں میں بیان کرنے کے لئے لکھی گئی ہے۔ اس کتابچہ میں بیان کردہ تمام احکامات فقہ احوط اور دعوات صوفیہ امامیہ کی روشنی میں لکھے گئے ہیں۔ موجودہ دور جہاں لوگوں کے پاس وقت کم ہے اور بڑی کتابوں سے استفادہ کرنا ممکن نہیں، ان کے لئے اس قسم کی مختصر اور جامع کتابیں کافی مفید ثابت ہوتی ہیں۔ میں اس کتابچہ کی تیاری میں مدد کرنے والے جناب ڈاکٹر محمد اقبال صاحب خپلوکھانسر اور جناب سید مصطفیٰ الموسوی صاحب کریس کا شکر گزار ہوں جنہوں نے شروع سے لے کر آخری مراحل تک میرے ساتھ بھرپور تعاون کا مظاہرہ کیااور مفید مشوروں سے نوازا۔ میری قارئین سے گزارش ہے کہ اگر کہیں کوئی غلطی یا سقم نظر آئے تونشاندہی فرمائیں تاکہ اس کی درستگی اور تصحیح ہوسکے۔ میری دعا ہے کہ اللہ تعالیٰ ہم سب کو دین اسلام اور اس مسلک حقہ کی خدمت کرنے اور عمل کرنے کی توفیق عطا فرمائیں۔ آمین، والسلام علی من اتبع الھدیٰ خیر اندیش محمد حسن شاد ؔایم اے، فاضل عربی، فاضل اردو، شہادۃ الفراغیہ، ڈی آئی ٹی خطیب وپیش امام جامع مسجد صوفیہ امامیہ نوربخشیہ کوئٹہ بلوچستان 16 ستمبر 2008 ء بروز منگل بمطابق 15 رمضان المبارک 1429ھ یوم ولادت امام حسن مجتبیٰ علیہ السلام "}],
          "عرض ناشر":[{"":"انجمن صوفیہ امامیہ المعروف نوربخشیہ رجسٹرڈ کوئٹہ بلوچستان کے زیرنگرانی ’’میر دانیال شہیدؒ لائبریری‘‘ کا قیام14 اکتوبر 2007ء بروز اتوار عید الفطر کو عمل میں آیا۔ کوئٹہ میں نوربخشی نوجوانوں کی یہ پہلی کوشش ہے جو انہوں نے نئی نسل کی علمی ضروریات کو مدنظر رکھ کر کی ہے۔ کیونکہ موجودہ دور، ایک انقلاب اور تبدیلی کا دور ہے جس میں علم کو خاص اہمیت حاصل ہے علم کے حصول کے لئے کتابوں کی فراہمی بنیادی حیثیت رکھتی ہے۔ لہٰذا ایک لائبریری کے قیام کی ضرورت کوشدت سے محسوس کیاگیا، اسی جذبے کے تحت اس لائبریری کا قیام عمل میں آیا۔ اس لائبریری کے قیام کا بنیادی مقصد قرآن مجید، سنت رسول ؐ اور اقوال معصومین ؑکے مطابق نوربخشی بزرگوں کے آثار اور تعلیمات کو عام کرنا ہے ،خصوصاً حضرت امیر کبیر سید علی ہمدانی علیہ الرحمہ اورحضرت میر سید محمد نوربخش نور اللہ مرقدہ اعلی اللہ مقامہ کی تعلیمات سے لوگوں کو روشناس کرانااور نوربخشی تعلیمات کی روشنی میں نئی نسل کی تربیت کرنا ہے۔ اس سلسلے میں درس وتدریس اور نوربخشی آثار کے تحفظ اور تعلیمات کی اشاعت کے لئے کام کرنا بھی اس لائبریری کے منشور میں شامل ہیں۔ چنانچہ لائبریری کے اشاعتی کاؤشوں کی پہلی کڑی ’’احکام میت‘‘ قارئین کے زیر نظر ہے۔ ہم امید کرتے ہیں کہ یہ کتابچہ قارئین کرام ضرور پسند کریں گے اور ہماری حوصلہ افزائی فرمائیںگے ۔ انسان خطا ونسیان کا مرکب ہے، اس لئے ہم کسی لفظی اور طباعتی غلطیوں کے بارے میں محترم قارئین سے معذرت کے ساتھ گزارش کرتے ہیں کہ وہ تعمیری جذبے کے تحت غلطی کی نشاندہی فرمائیںاور مفید مشوروں سے ہمیں نوازیں۔ اللہ تعالیٰ ہم سب کو نیک کام کرنے اور نیک کام کرنے والوں کے ساتھ تعاون کرنے کی توفیق دے۔ آمین ،ناشر میر دانیال شہید ؒ لائبریری کوئٹہ بلوچستان "}],
          "موت":[{"موت کی تعریف و کیفیت":"موت ایک حتمی فیصلہ خداوندی ہے جو ہر نفس اور ہر ذی روح کے لئے مقرر ہے۔ اسی لئے اللہ تعالیٰ نے قرآن مجید میں فرمایا ہے۔ کُلُّ نَفْسٍ ذَائِقَۃُ الْمَوْتِ۔ (آل عمران ۱۸۵/الانبیاء ۳۵/عنکبوت ۵۷) ترجمہ:۔ ہر نفس(جان) موت کا مزہ چکھے گی۔ موت سفر آخرت کی پہلی منزل ہے جو ہر نفس اور ذی روح کو آنی ہے۔ ایک دن ایسا آئے گا کہ دنیا کی ہر چیز فنا ہوگی اور صرف ذات باری تعالیٰ باقی رہے گا۔ جیساکہ قرآن مجید میںاللہ تعالیٰ فرماتے ہیں، کُلُّ مَنْ عَلَیْھَا فَانٍ۔ وَیَبْقیٰ رَبُّکَ ذُوالْجَلَالِ وَالْاِکْرَامِ ۔ (رحمٰن)ترجمہ : ہر چیز فنا ہوگی اور صرف صاحب جلالت وعزت والا رب باقی رہے گا۔ "},
                  {"زندگی اور موت کا فلسفہ":"موت کی تعریف کے بارے میں علماء فرماتے ہیں۔ اَلْمَوْتُ صِفَّۃٌ وَجُودَۃٌ مُضَادَۃٌ لِلْحَیَاتِ۔ موت ایک وجودی صفت ہے جو حیات کی ضد ہے۔ حضرت علی علیہ السلام نے موت کے بارے میں فرمایا لِکُلِّ دَارٍ بَابٌ بَابُ الْآخِرَۃِ اَلْمَوْتُ۔ ہر گھر کے لئے ایک دروا زہ ہے اور آخرت کا دروازہ موت ہے۔ امام محمد تقی علیہ السلام موت کے بارے میں فرماتے ہیں۔ ھُوَ النَّوْمُ الَّذِیْ یَاتِیْکُمْ کُلَّ لَیْلَۃٍ اِلَّا اَنَّہٗ طَوِیْلُ مُدَّتِہِ لَایَنْتَبِہ مِنْہٗ اِلَّا یَوْمَ الْقِیَامَۃِ۔ ترجمہ: موت ہر رات کو آنے والی نیند کی طرح ہے مگر صرف فرق یہ ہے کہ یہ ایک ایسی طویل نیند ہے جسے صرف قیامت کے دن ہی بیدار ہوگا۔ "},
                  {"نکیر ومنکر کا قبر میں سوال":"زندگی اور موت کے بارے میں قرآن مجید میں ارشاد خداوندی ہے۔ تَبَارَکَ الَّذِیْ بِیَدِہِ الْمُْلْکُ وَھُوَ عَلیٰ کُلّ شَیْیٍٔ قَدِیْرٌ ۔ الَّذِیْ خَلَقَ الْمَوْتَ وَالَحَیٰوۃَ لِیَبْلُوَکُمْ اَیُّکُمْ اَحْسَنُ عَمَلاً ۔ (ملک ۱) ترجمہ: بابرکت ہے وہ ذات جس کے ہاتھ میں بادشاہی ہے اور وہ ہر چیز پر قادر ہیں۔ اسی نے موت اور زندگی کو پیدا کیا تاکہ وہ تمہیں آزمائش کرے کہ تم میں کون اچھے عمل کرتا ہے۔ پس انسان کو دنیا میں ایک امتحان کے لئے خلق کیا ہے۔ وہ امتحان یہ ہے کہ کون اچھا عمل کرتا ہے اورکون برا عمل ؟ جو اس دنیامیں اچھا عمل کریں ان کیلئے جنت ہیں اور جو برا عمل کریں ان کے لئے جہنم کو تیار کیا ہواہے۔ "},
                  {"موت کے بعد عالم برزخ کا دور":"جن چیزوں پر اعتقاد رکھنا مسلک نوربخشیہ کا جزء ہے اس میں سے ایک سوال نکیر ومنکر بھی ہے۔ احادیث معتبرہ سے یہ ظاہر ہے کہ قبر میں مردے کو دوبارہ زندہ کرکے اسے سوال کیا جاتا ہے۔ قبر میں سب سے پہلے عقائد کے بارے میں اور اس کے بعد اعمال کے بارے میں سوال کیا جائے گا۔"},
                  {"اپنی فکر کریں":"برزخ کے لغوی معنی پردہ اور رکاوٹ کے ہیں۔ اصطلاح کے لحاظ سے برزخ وہ عالم ہے جو دنیا اور قیامت کے درمیان ہے۔ حضرت امام جعفر صادق ؑ فرماتے ہیں ، خدا کی قسم مجھے تمہارے برزخ کا زیادہ خوف ہے، راوی کہتا ہے کہ میں نے عرض کیا برزخ کیا ہے؟ آپ ؑ نے فرمایا مرنے سے قیامت تک کا زمانہ ہے۔ قرآن مجید میں ہے ، وَمِنْ وَرَائِہِمْ بَرْزَخٌ اِلیٰ یَوْمٍ یُبْعَثُوْنَ۔ (مومنون ۱۰۰)رجمہ: اور اس کے پیچھے قیامت تک کا وقت برزخ ہے۔ "},{"تلقین توبہ":"امام جعفر صادق علیہ السلام نے فرمایا ، ذِکْرُ الْمَوْتِ یُمِیْتُ الشَّہَوَاتِ فِی النَّفْسِ ترجمہ: موت کی یاد ،نفس میں موجود شہوات کو ختم کردیتی ہیں۔ ہر انسان کو چاہئے کہ وہ مرنے کی فکر کریں اور قیامت کی یاد رکھیںکیونکہ موت اور قیامت کی یاد انسان کو عمل وعبادت اور حصول رضائے الٰہی کی طرف راغب کرتی ہے۔ انسان کا مقصد حیات بھی یہی کہ وہ زندگی میں عبادت خداوندی کا حق ادا کرے اور اللہ ورسول کے احکام پر عمل کرے۔"}],
          "غسل میت اور اسکی تفصیل":[{"میت کیلئے چار چیزیں واجب ہیں":"آدمی کے جسم سے روح نکل جانے کے بعددرج ذیل احکامات بجالائیں۔ ۱: میت کے چہرے کو قبلہ کی طرف پھیر دیا جائے۔ ۲: ہاتھ پاؤں سیدھے کئے جائیں۔ ۳: منہ اور آنکھوں کو بند کیا جائے کوئی ہلکا سا کپڑا اوپر ڈال دیا جائے ۴: پیٹ پر کوئی بھاری چیز رکھ دی جائے تاکہ میت کے جسم سے بدبو دور ہوجائے۔ ۵: اگر غسل میں دیر ہو اور میت رات بھر گھر میں رہے تو صبح ہونے تک قرآن شریف یا اوراد فتحیہ، اوراد عصریہ میت کے ارد گرد بلند آواز سے پڑھتے رہیں اور رات کو بیدار رہیں اور اپنے مرنے کی فکر اور مرنے والے کے ایصال ثواب کے لئے صدقہ وخیرات کی تدبیر کریں۔ اگر کسی جنازہ پر نظر پڑے تو اس وقت یہ دعا پڑھے۔ سُبْحَانَ الْمَلِکِ الْحَیِّ الَّذِیْ لَایَنَامُ وَلَایَمُوْتُ اِنَّا لِلّٰہِ وَاِنَّا اِلَیْہِ رَاجِعُوْنَ وَیَفْعَلُ اللّٰہُ مَایَشَآئُ وَیَحْکُمُ مَایُرِیْدُ ۔ "},
                                     {"غسل سے پہلے کے احکام":"میت کے متعلق مندرجۂ ذیل چار چیزیں واجب ہیں۔ ۱: غسل دینا ۲: کفن پہنانا ۳ : نماز جنازہ کا پڑھنا ۴: دفن کرنا "},
                                     {"غسل دینے کا حقدار کون؟":"مرُدے کو غسل دینے سے قبل درج ذیل باتوں کا خیال رکھا جائے۔ ۱: مرُدے کو کسی چھت والے کمرے میں غسل دیا جائے۔ ۲: مرُدے کا سر شمال کی جانب رکھا جائے اور پاؤں جنوب کی طرف تاکہ اس کا منہ قبلہ کی طرف رہے۔ ۳: مرُدے کے جسم سے نجاست دور کرے۔ ۴: استنجاء اور غسل دینے والا بائیں ہاتھ پر کپڑا لپیٹ لے۔ ۵: غسل دینے والامرُدے کی بائیں ٹانگ کو اپنے دائیں ہاتھ سے اٹھائے اور اگرنہ ہوسکے تو کسی اور سے مددلے۔ ۶: منہ اورناک میں پانی نہ ڈالے بلکہ اشارہ کرے۔ ۷: مردے کے ہاتھ اور پاؤں کے ناخنوں کے میل وغیرہ کو دور کرے۔ ۸: کوئی نرم چیز میت کے نیچے بچھائے۔ کپڑے اتارتے وقت زندوں کے برعکس یعنی پیروں کی جانب سے اتارا جائے۔ مندرجہ بالا احکامات کو بجالانے کے بعدمیت کو غسل دینے کے لئے سب سے پہلے وضو کرائیں، اس کے بعد غسل کی نیت کریں اور میت کے سرکو گردن سمیت دھولیں پھر میت کی بائیں جانب کو اور دائیں جانب پورے جسم کو دھوئیں۔ "},
                                     {"غسل کے احکام":"مناسب طریقہ یہ ہے کہ مرد کو مرد غسل دے اور عورت کو عورت ، میاں بیوی میں سے ہر ایک کا دوسرے کو غسل دینا جائز ہے۔ اگر مردوں کے لئے غسل دینے والا سوائے عورتوں کے کوئی نہ پاسکے اور عورتوں کے غسل دینے والا سوائے مردوں کے کوئی نہ مل سکے اور وہاں کوئی محرم شخص بھی نہ ہو تو اس صورت میں صرف تیمم ہی جائز ہے۔ اگر ایک میت کے غسل کی بجا آوری کے لئے بہت سے لوگ جمع ہوجائیں تو میت کو غسل دینے کا سب سے زیادہ حقدار میت کا سرپرست ہے یا اس کا سب سے قریبی وارث ہے یا وہ شخص زیادہ حقدار ہوگا جس کو ان دونوں میں سے کسی نے اجازت دی ہو۔ "},
                                     {"میت کا طریقہ غسل":"مردے کو غسل دینے سے پہلے اس کے بدن پر اگر کوئی ناپاکی موجود ہو تو پہلے اس کو رفع کیاجائے اس کے بعد مردے کو استنجاء واستبراء کیا جائے۔ مردے کو استنجاء کرتے وقت اس دعا کو پڑھے۔ اَلّٰلھُمَّ حَصِّنْ فَرْجَہٗ وَ اسْتُرْ عَوْرَتَہٗ مِنَ النَّارِ۔ عورت کے لئے فَرْجَھَااور عَوْرتَھَا پڑھا جائے۔ مرد کے لئے وضو کی نیت اس طرح کرے۔ اُوَضِّؤُ ھٰذَا الْمَیِّتَ لِنُدْبِہٖ قُرْبَۃً اِلَی اللّٰہِ عورت کے لئے : اُوَضِّؤُ ھٰذِہِ الْمَیِّتَۃَ لِنُدْبِہٖ قُرْبَۃً اِلَی اللّٰہِ نیت پڑھ چکنے کے بعد میت کی کلائیوں تک ہاتھوں کو دھو ڈالے۔ منہ اور ناک میں پانی ڈالنے کا اشارہ کرے اور اس طرح مرد کے لئے تعوذ پڑھے۔ اُعِیْذُہُ بِاللّٰہِ مِنَ الشَّیْطَانِ الرَّجِیْمِ عورت کے لئے : اُعِیْذُھَا بِاللّٰہِ مِنَ الشَّیْطَانِ الرَّجِیْمِ چہرہ دھلاتے وقت مرد کے لئے یوں پڑھے۔ اَللّٰہُمَّ بَیِّضْ وَجْہَہٗ بِنُوْرِ مَعْرِفَتِکَ یَوْمَ تُبَیِّضُّ وُجُوْہَ اَوْلِیَائِکَ وَتُسَوِّدُّ وُجُوْہَ اَعْدَائِکَ۔ عورت کے لئے : اَللّٰہُمَّ بَیِّضْ وَجْہَھَا پڑھے۔ دائیں ہاتھ دھلاتے وقت مرد کیلئے یوں پڑھے۔ اَللّٰہُمَّ اَعْطِہِ کِتَابَہٗ بِیَمِیْنِہٖ وَحَاسِبْہٗ حِسَاباً یَّسِیْراً۔ عورت کے لئے یوں پڑھے۔ اَللّٰہُمَّ اَعْطِھَا کِتَابَھَا بِیَمِیْنِھَا وَحَاسِبْھَا حِسَاباً یَّسِیْراً۔ بائیں ہاتھ دھلاتے وقت مرد کے لئے یوں پڑھے۔ اَللّٰہُمَّ لَاتُعْطِہٖ کِتَابَہٗ بِشِمَالِہٖ وَلَا مِن وَّرَآئِ ظَہْرِہٖ۔ عورت کے لئے یوں پڑھے۔ اَللّٰہُمَّ لَا تُعْطِھَا کِتَابَھَا بِشِمَا لِھَا وَلَا مِن وَّرَآئِ ظَہْرِھَا۔ سر کا مسح کرتے وقت مرد کے لئے یوںدعا پڑھے۔ اَللّٰھُمَّ غَشِّہٖ رَأسَہُ بِرَأفَتِکَ وَرَحْمَتِکَ وَظَلِّلْہُ تَحْتَ ظِلَالِ عَرْشِکَ۔ عورت کے لئے یوں پڑھے۔ اَللّٰھُمَّ غَشِّھَا رَأسَھَا بِرَأفَتِکَ وَرَحْمَتِکَ وَظَلِّلْھَا تَحْتَ ظِلَالِ عَرْشِکَ پیروں کا مسح کرتے وقت مرد کیلئے یوں پڑھے۔ اَللّٰھُمَّ ثَبِّتْ قَدَمَیْہِ عَلَی الصِّرَاطِ یَوْمَ تُثَبِّتُ فِیْہِ الْاَقْدَامَ وَتُزِلُّ فِیْہِ الْاَقْدَامَ ۔ عورت کیلئے یوں پڑھے۔ اَللّٰھُمَّ ثَبِّتْ قَدَمَیْھَا عَلَی الصِّرَاطِ یَوْمَ تُثَبِّتُ فِیْہِ الْاَقْدَامَ وَ تُزِلُّ فِیْہِ الْاَ قْدَامَ۔"},
                                     {"سدرہ کے پانی سے غسل":"بہتر طریقہ یہ ہے کہ سدرہ کا پانی تھوڑا گرم ہو۔ کافور کا پانی نیم گرم ہو اور تازہ پانی ٹھنڈا ہو۔ اسی طرح غسل دیتے وقت سدرہ کے پانی سے غسل پہلے ہو پھر کافور کے پانی سے غسل دیا جائے اور آخر میں خالص تازہ پانی سے غسل دیا جائے۔"},
                                     {"کافور کے پانی سے غسل":"سدرہ کے پانی سے غسل دیتے وقت مرد کے لئے اس طرح نیت کرے۔ اُغَسِّلُ ھٰذَا الْمَیِّتَ بِمَآئِ السِّدْرِلِنُدْبِہٖ قُرْبَۃً اِلَی اللّٰہِ۔ عورت کیلئے یوں نیت کرے۔ اُغَسِّلُ ھٰذِہِ الْمَیِّتَۃِ بِمَآئِ السِّدْرِلِنُدْبِہٖ قُرْبَۃً اِلَی اللّٰہِ۔"},
                                     {"تازہ پانی سے غسل":"کافور کے پانی سے غسل دیتے وقت مرد کیلئے نیت یوں کرے۔ اُغَسِّلُ ھٰذَا الْمَیِّتَ بِمَآئِ الْکَافُوْرِ لِنُدْبِہٖ قُرْبَۃً اِلَی اللّٰہِ۔ عورت کیلئے نیت یوں کرے۔ اُغَسِّلُ ھٰذِہِ الْمَیِّتَۃَ بِمَآئِ الْکَافُوْرِ ِلِنُدْبِہٖ قُرْبَۃً اِلَی اللّٰہِ۔ "},
                                     {"سدرہ وکافور کے عوض غسل":"مرد کیلئے نیت یوں کرے۔ اُغَسِّلُ ھٰذَا الْمَیِّتَ بِمَآئِ الْقَرَآحِ لِوُجوُبِہٖ قُرْبَۃً اِلَی اللّٰہِ۔ عورت کیلئے یوں نیت پڑھے۔ اُغَسِّلُ ھٰذِہِ الْمَیِّتَۃَ بِمَآئِ الْقَرَآحِ لِوُجُوْبِہٖ قُرْبَۃً اِلَی اللّٰہِ۔ "},
                                     {"دوران غسل پڑھی جانیوالی دعا":"سدرہ کافور نہ ہونے کی صورت میں مرد کیلئے سادہ پانی سے غسل دیتے وقت یوں نیت کرے۔ اُغَسِّلُ ھٰذَا الْمَیِّتَ بِمَآئِ الْخَالِصِ عِوَضاً عَنْ مَّآئِ السِّدْرِ لِنُدْ بِہِ قُرْبَۃً اِلَی اللّٰہِ۔ عورت کیلئے یوں نیت کرے۔ اُغَسِّلُ ھٰذِہِ الْمَیِّتَۃَ بِمَآئِ الْخَالِصِ عِوَضاً عَنْ مَّآئِ السِّدْرِ لِنُدْ بِہِ قُرْبَۃً اِلَی اللّٰہِ۔ اگر کافور نہ ملے تو کافور کے بدلے میں تازہ پانی سے غسل دیا جاتا ہے۔ اس صورت میں مرد کیلئے نیت یوں کی جائے۔ اُغَسِّلُ ھٰذَا الْمَیِّتَ بِمَآئِ الْخَالِصِ عِوَضاً عَنْ مَآئِ الْکَافُوْرِ لِنُدْ بِہِ قُرْبَۃً اِلَی اللّٰہِ۔ عورت کیلئے یوں نیت کرے۔ اُغَسِّلُ ھٰذِہِ الْمَیِّتَۃَ بِمَآئِ الْخَالِصِ عِوَضاً عَنْ مَآئِ الْکَافُوْرِ لِنُدْ بِہِ قُرْبَۃً اِلَی اللّٰہِ۔"},
                                     {"دوران غسل پڑھی جانیوالی دعا":"مرد کیلئے یوں پڑھے۔ اَللّٰھُمَّ طَھِّرْ قَلْبَہٗ وَزَکِّ عَمَلَہٗ وَاجْعَلْ لَّہٗ مَا عِنْدَکَ خَیْراً وَّاجْعَلْہٗ مِنَ التَّوَّابِیْنَ وَاجْعَلْہٗ مِنَ الْمُتَطَھِّرِیْنَ۔ عورت کے لئے یوں پڑھے۔ اَللّٰھُمَّ طَھِّرْ قَلْبَہَا وَزَکِّ عَمَلَہَا وَاجْعَلْ لَّھَا مَا عِنْدَکَ خَیْراً وَّاجْعَلْھَا مِنَ التَّوَّابِیْنَ وَاجْعَلْہَا مِنَ الْمُتَطَھِّرِیْنَ۔"},
                                     {"حنوط لگانے کی نیت":"جو اعضاء سجدے کی حالت میں زمین سے لگتے ہیں ان اعضاء پر حنوط لگانا سنت ہے۔ یعنی پیشانی ، ناک، دونوں ہتھیلیاں، دونوںگھٹنے اور پیروںکے دونوں انگوٹھے۔ حنوط لگاتے وقت مرد کے لئے یوں نیت کرے۔ اُحَنِّطُ ھٰذَا الْمَیِّتَ لِنُدْبِہٖ قُرْبَۃً اِلیَ اللّٰہِ ۔ عورت کے لئے یوں پڑھے۔ اُحَنِّطُ ھٰذِہٖ الْمَیِّتَۃَ لِنُدْبِہٖ قُرْبَۃً اِلیَ اللّٰہِ ۔ "},
                                     {"میت کو غسل کے بدلے تیمم":"اگر کسی عذر (مثلاً جسم کے کسی حصے سے خون یا پیپ کا اخراج،آگ یا کسی دوسری چیز سے جھلسا ہوا ہو)کی بناء پر مردے کو پانی سے غسل دینا ممکن نہ ہو یا پانی نہ ملے تو غسل کے بدلے تیمم کیا جائے۔ مرد کے لئے نیت اس طرح کرے۔ اُیَمِّمُ ھٰذَا الْمَیِّتَ بَدَلَ الْغُسْلِ لِوُجُوْبِہٖ قُرْبَۃً اِلَی اللّٰہِ۔ عورت کے لئے نیت اس طرح کرے۔ اُیَمِّمُ ھٰذِہٖ الْمَیِّتَۃَ بَدَلَ الْغُسْلِ لِوُجُوْبِہٖ قُرْبَۃً اِلَی اللّٰہِ۔"},
                                     {"تیمم کا طریقہ":"میت کو غسل کے بدلے تیمم کرنے کے لئے پہلے نیت کرکے غسل کرانے والا اپنا ہاتھ پاک مٹی پر مارے، اس کے بعد مردے کے چہرے کو مسح کرے پھر دونوں ہاتھوں کو کہنیوں تک مسح کرے۔ "},
                                     {"سدرہ وکافور کے عوض تیمم":"سدرہ وکافور کے بدلے اگر غسل کے لئے پانی نہ ملے تو تیمم کرے۔ مرد کے لئے یوں نیت کرے۔ اُیَمِّمُ ھٰذَا الْمَیِّتَ عِوَضًا عَنْ مَّآئِ السَّدْرِ لِنُدْبِہٖ قُرْبَۃً اِلیَ اللّٰہِ ۔ عورت کے لئے یوں نیت کرے۔ اُیَمِّمُ ھٰذِہِ الْمَیِّتَۃَ عِوَضًا عَنْ مَّآئِ السَّدْرِ لِنُدْبِہٖ قُرْبَۃً اِلیَ اللّٰہِ ۔ کافور کے پانی کے بدلے تیمم کرے تو مرد کے لئے یوں نیت کرے۔ اُیَمِّمُ ھٰذَا الْمَیِّتَ عِوَضًا عَنْ مَّآئِ الْکَافُوْرِ لِنُدْبِہٖ قُرْبَۃً اِلیَ اللّٰہِ ۔ عورت کے لئے یوں نیت کرے۔ اُیَمِّمُ ھٰذِہِ الْمَیِّتَۃَ عِوَضًا عَنْ مَّآئِ الْکَافُوْرِ لِنُدْبِہٖ قُرْبَۃً اِلیَ اللّٰہِ ۔ آب خالص کے عوض تیمم کرے تو مرد کے لئے یوں نیت کرے۔ اُیَمِّمُ ھٰذَا الْمَیِّتَ عِوَضًا عَنْ مَّآئِ الْقَرَاحِ لِوُجُوْبِہٖ قُرْبَۃً اِلیَ اللّٰہِ۔ عورت کے لئے یوں پڑھے۔ اُیَمِّمُ ھٰذِہِ الْمَیِّتَۃَ عِوَضًا عَنْ مَّآئِ الْقَرَاحِ لِوُجُوْبِہٖ قُرْبَۃً اِلیَ اللّٰہِ۔"},],
          "تکفین کا مسئلہ ":[{"":"حضرت میرسید محمد نوربخشؒ کے حکم کے مطابق مردہ مرد کو تین اوڑھنیاں یا مندرجۂ ذیل کپڑوں سے کفن پہنانا سنت ہے۔ ۱: قمیص ۲ : عمامہ ۳ : اوڑھنی البتہ مقام پردہ کو چھپانا واجبی حکم ہے۔ مردہ عورت کو مندرجۂ ذیل کپڑوں سے کفن پہنائے جائیں۔ البتہ اوڑھنی سے پورے جسم کو چھپانا واجب ہے۔ ۱: قمیص ۲: دوپٹہ ۳: دو اوڑھنیاں (ایک واجب) (ایک سنت) ۴: شلوار "},
                                       {"کفن":"عمومی قد وقامت کے حامل مرد کے لئے تقریباً 10 میٹر اور عورت کے لئے 14 میٹر ایک میٹر = چار بالشت "},
                                       {"کفن پر لکھی جانیوالی دعا":"مرد اور عورت دونوں کے گریبان پر سورۂ الم نشرح لکھی جائے نیز مندرجہ ذیل کلمہ و دعا مردہ مرد کے عمامہ پر اور عورت کی چادر پر لکھی جائے۔ لَا اِلٰہَ اِلَّا اللّٰہُ مُحَمَّدٌ رَّسُوْلُ اللّٰہِ عَلِیٌّ وَّلِیُّ اللّٰہِ وَفَاطِمَۃُ اَمَۃُ اللّٰہِ وَالْحَسَنُ وَالْحُسَیْنُ صَفْوَۃُ اللّٰہِ عَلیٰ مُحِبِّیْھِمْ رَحْمَۃُ اللّٰہِ وَعَلیٰ مُبْغِضِّیْھِمْ لَعْنَۃُ اللّٰہِ o اَشْھَدُ اَنْ لَّا اِلٰہَ اِلَّا اللّٰہُ وَحْدَہٗ لَاشَرِیْکَ لَہٗ وَاَشْھَدُ اَنَّ مُحَمَّدًا عَبْدُہٗ وَرَسُوْلُہٗ۔ مصطفیٰؐ باسہ محمد ؑ مرتضیٰؑ باسہ علیؑ جعفرؑ وموسیٰ ؑوزہرا ؑیک حسینؑ ودو حسنؑ صَلَوَاتُ اللّٰہِ وَسَلَامُہٗ عَلَیْہِ وَعَلَیْہِمْ اَجْمَعِیْنَ اَللّٰھُمَّ اجْعَلْ قَبْرَہٗ رَوْضَۃً مِّنْ رِّیَاضِ الْجِنَانِ بِرَحْمَتِکَ یَا اَرْحَمَ الرَّاحِمِیْنَ ۔ عورت کی چادر پر یوں لکھا جائے۔ اَللّٰھُمَّ اجْعَلْ قَبْرَھَا رَوْضَۃً مِّنْ رِّیَاضِ الْجِنَانِ بِرَحْمَتِکَ یَا اَرْحَمَ الرَّاحِمِیْنَ ۔"},
                                       {"کفن پہنانے کا طریقہ":"مرد کے لئے کفن پہناتے وقت پہلے یوں نیت کرے۔ اُکَفِّنُ ھٰذَا الْمَیِّتَ لِوُجُوْبِہٖ قُرْبَۃً اِلیَ اللّٰہِ ۔ عورت کو کفن پہناتے وقت یوں نیت کرے۔ اُکَفِّنُ ھٰذِہِ الْمَیِّتَۃَ لِوُجُوْبِہٖ قُرْبَۃً اِلیَ اللّٰہِ ۔ پھر بِسْمِ اللّٰہِ الرَّحْمٰنِ الرَّحِیْمِ پڑھ کر کفن پہنایا جائے۔ کفن پہنانے کیلئے نیت سے پہلے کفن کو درست کریں اوڑھنی کو نیچے بچھائے اس کے اوپر قمیص کو اس کے بعد شلوارکودرست کریںاس کے بعدمیت کو اٹھاکر کفن پر رکھیں بعد ازاں مرد کیلئے عمامہ اور عورت کے لئے دوپٹہ پہنائیں آخر میں اوڑھنی کو پوری طرح لپیٹ دیں۔"},
                                       {"مردے کو تختے پر رکھنے کی نیت":"جنازے کو تختے پر رکھتے ہوئے مرد ہو تو یوں نیت کرے۔ اُنَعِّشُ ھٰذَا الْمَیِّتَ لِنُدْبِہٖ قُرْبَۃً اِلیَ اللّٰہِ ۔ عورت کے لئے یوں نیت کرے۔ اُنَعِّشُ ھٰذِہِ الْمَیِّتَۃَ لِنُدْبِہٖ قُرْبَۃً اِلیَ اللّٰہِ ۔ جنازہ اٹھاتے وقت اس دعا کو تین بار پڑھے۔ اَلْحُکْمُ لِلّٰہِ وَالْحُکْمُ لِلّٰہِ وَالْمُلْکُ لِلّٰہِ۔ اَللّٰہُ اَکْبَرُ۔لَا اِلٰہَ اِلَّا اللّٰہُ مُحَمَّدٌ رَّسُوْلُ اللّٰہِ عَلِیٌّ وَّلِیُّ اللّٰہِ۔ "},
                                       {"جنازہ زمین پر رکھتے وقت":"میت کو اٹھانے کے لئے چار آدمیوں کا ہونا سنت ہے اگر چار آدمی نہ ہوں تو جتنی تعداد آدمیوں کی ملے اٹھائے ،میت کو اٹھانے والے درمیانی رفتار سے چلیں نہ زیادہ جلدی کریں اور نہ زیادہ دیر کریں۔ جنازے کے پیچھے پیچھے چلنا اورچلتے ہوئے کلمۂ شہادتین کا پڑھناسنت ہے۔ بہتر صورت یہ ہے کہ جنازے کو اٹھانے پر قدرت رکھنے والے جنازے کے پیچھے پیچھے چلیں اور اٹھانے پر قدرت نہ رکھنے والے آگے آگے چلیں۔ راستے کی کشادگی کی صورت میں جنازے کے دائیں اور بائیں طرف سے چلنا جائز ہے۔ "}],
          "نماز جنازہ ":[{"":"نماز جنازہ ہر میت ( مرد وعورت)کے لئے پڑھنا فرض کفایہ ہے یہ نماز باجماعت اور انفرادی دونوں صورتوں میں پڑھی جاسکتی ہیں۔نماز جنازہ میت کو دفن کرنے سے پہلے پڑھنا واجب ہے۔ "},
                                     {"واجبات":"نماز جنازہ میں درج ذیل احکام واجب ہیں۔ ۱: نیت کرنا ۲: تکبیر ۃ الاحرام ۳: قیام ۴: پانچ تکبیرات ۵: سلام ۶: ترتیب"},
                                     {"مسنونات":"نماز جنازہ میں درج ذیل امور سنت ہیں۔ ۱: تکبیر کے درمیان دعائیں پڑھنا (مخصوص دعا یاد نہ ہو تو کلمہ تمجید بمعہ درود پڑھنا بھی درست ہے۔ ۲ : ہر تکبیر کے ساتھ ہاتھوں کا بلند کرنا ۳: نماز جنازہ میں امام مرد ہ مرد کے جسم کے درمیان اور عورت کے سینے کے روبرو کھڑا ہو جائے۔ "},
                                     {"نیت نماز جنازہ":"ایک مرد کیلئے یوں نیت کی جائے۔ اُصَلِّیْ صَلوٰۃَ ھٰذَا الْمَیِّتِ بِالْجَمَاعَۃِ لِوُجُوْبِھَا قُرْبَۃً اِلَی اللّٰہِ ایک عورت کیلئے یوں نیت کی جائے۔ اُصَلِّیْ صَلوٰۃَ ھٰذِہِ الْمَیِّتَۃِ بِالْجَمَاعَۃِ لِوُجُوْبِھَا قُرْبَۃً اِلَی اللّٰہِ اگر دو جنازے ہوں ان میں سے دونوں مرد ہوں یا ایک مرد اور ایک عورت ہوتو اس وقت اس طرح نیت کی جائے۔ اُصَلِّیْ صَلوٰۃَ ھٰذَیْنِ الْمَیِّتَیْنِ بِالْجَمَاعَۃِ لِوُجُوْبِھَا قُرْبَۃً اِلَی اللّٰہِ ۔ اگر دو عورتیں ہوں تو یوں نیت کی جائے۔ اُصَلِّیْ صَلوٰۃَ ھَاتَیْنِ الْمَیِّتَتَیْنِ بِالْجَمَاعَۃِ لِوُجُوْبِھَا قُرْبَۃً اِلَی اللّٰہِ۔ اگر دو سے زیادہ مردے ہوں ان میںسے سارے مرد ہوں یا کچھ عورت کچھ مرد ، تو نیت اس طرح کی جائے۔ اُصَلِّیْ صَلوٰۃَ ھٰؤُلآئِ الْاَمْوَاتِ بِالْجَمَاعَۃِ لِوُجُوْبِھَا قُرْبَۃً اِلَی اللّٰہِ۔ امام کے لئے اپنی نیت میں بِالْجَمَاعَۃِ کی جگہ اِمَاماً پڑھنا بہتر ہے۔ "},
                                     {"طریقہ نماز جنازہ":"نیت اور تکبیرۃ الاحرام کے بعد یوں دعا پڑھی جائے۔ اَلْحَمْدُ لِلّٰہِ وَالثَّنَآئُ لِلّٰہِ اَشْہَدُ اَنَّ لَا اِلٰہَ اِلَّا اللّٰہُ وَحْدَہٗ لَاشَرِیْکَ لَہٗ وَاَشْہَدُ اَنَّ مُحَمَّداً عَبْدُہٗ وَرَسُوْلُہٗ۔ اس کے بعد سورہ فاتحہ پڑھ کر دوسری تکبیر پڑھیں۔ اور یہ دعا پڑھی جائے۔ اَللّٰھُمَّ صَلِّ عَلٰی مُحَمَّدٍ وَّ آلِ مُحَمَّدٍ وَبَارِکْ وَسَلِّمْ عَلَیْہِمْ کَمَا صَلَّیْتَ وَسَلَّمْتَ وَبَارَکْتَ وَتَرْحَمْتَ عَلٰی اِبْرَاہِیْمَ وَعَلٰی آلِ اِبْرَاہِیْمَ اِنَّکَ حَمِیْدٌ مَّجِیْدٌ ۔ اس کے بعد تیسری تکبیر پڑھیں۔ تیسری تکبیر کے بعد اگر نماز جنازہ ایک مرد کی ہو تو یوں دعا پڑھیں۔ اَللّٰہُمَّ اِنَّ ھٰذا عَبْدُکَ وَابْنُ عَبْدِکَ خَرَجَ مِنْ رَّوْحِ الدُّنْیَا وَسِعَتِھَا اِلٰی ظُلْمَۃِ الْقَبْرِ وَکَانَ یَشْہَدُ اَنْ لَّا اِلٰہَ اِلَّا اَنْتَ وَاَنَّ مُحَمَّداً عَبْدُکَ وَرَسُوْلُکَ وَاَنْتَ اَعْلَمُ بِہٖ۔ اَللّٰہُمَّ تُرِکَ بِکَ وَاَنْتَ خَیْرُ مَتْرُوْکٍ بِہٖ وَاَصْبَحَ فَقِیْراً اِلٰی رَحْمَتِکَ وَاَنْتَ غَنِیٌّ عَنْ عَذَابِہٖ ۔ وَقَدْجِئْنَاکَ رَاغِبِیْنَ اِلَیْکَ شُفَعَآئَ لَہٗ ۔ اَللّٰہُمَّ اِنْ کَانَ مُحْسِناً فَزِدْ فِیْ اِحْسَانِہٖ وَاِنْ کَانَ مُسِیْٓئاً فَاغْفِرْلَہٗ وَتَجَاوَزْ عَنْہُ وَلَقِّہٖ بِرَحْمَتِکَ وَرِضَاکَ وَقِہٖ مِنْ فِتْنَۃِ الْقَبْرِ وَعَذَابِہٖ وَافْسَحْ لَہٗ فِیْ قَبْرِہِ وَجَافِ الْاَرْضَ عَنْ جَنْبَیْہِ وَلَقِّہٖ بِرَحْمَتِکَ الْاَمْنَ مِنْ عَذَابِکَ حَتّٰی تَبْعَثَہُ اِلٰی جَنَّتِکَ یَا اَرْحَمَ الرَّاحِمِیْنَ۔ اگر نمازجنازہ ایک عورت کی ہو تو یوں دعا پڑھے۔ اَللّٰہُمَّ اِنَّ ھٰذِہِ اَمَتُکَ وَابْنَۃُ اَمَتِکَ خَرَجَتْ مِنْ رَّوْحِ الدُّنْیَا وَسِعَتِھَا اِلٰی ظُلْمَۃِ الْقَبْرِ وَکَانَتْ تَشْہَدُ اَنْ لَّا اِلٰہَ اِلَّا اَنْتَ وَاَنَّ مُحَمَّداً عَبْدُکَ وَرَسُوْلُکَ وَاَنْتَ اَعْلَمُ بِھَا۔ اَللّٰہُمَّ تُرِکَتْ بِکَ وَاَنْتَ خَیْرُ مَتْرُوْکٍ بِہَا وَاَصْبَحَتْ فَقِیْراً اِلٰی رَحْمَتِکَ وَاَنْتَ غَنِیٌّ عَنْ عَذَابِہِ۔ وَقَدْجِئْنَاکَ رَاغِبِیْنَ اِلَیْکَ شُفَعَآئَ لَہَا ۔ اَللّٰہُمَّ اِنْ کَانَتْ مُحْسِنَۃً فَزِدْ فِیْ اِحْسَانِہَا۔ وَاِنْ کَانَتْ مُسِیْئَۃً فَاغْفِرْلَھَا وَتَجَاوَزْ عَنْہَا وَلَقِّہَا بِرَحْمَتِکَ وَرِضَاکَ وَقِہَا مِنْ فِتْنَۃِ الْقَبْرِ وَعَذَابِہَا وَافْسَحْ لَھَا فِیْ قَبْرِھَا وَجَافِ الْاَرْضَ عَنْ جَنْبَیْھَا وَلَقِّھَا بِرَحْمَتِکَ الْاَمْنَ مِنْ عَذَابِکَ حَتّٰی تَبْعَثَھَا اِلٰی جَنَّتِکَ یَا اَرْحَمَ الرَّاحِمِیْنَ۔ اگردو مرد یا ایک مرد اور ایک عورت کے نماز جنازے پڑھنے ہوں تو یوں دعا پڑھے۔ اَللّٰہُمَّ اِنَّ ھٰذَیْنِ عَبْدَاکَ وَابْنَا عَبْدَیْکَ خَرَجَا مِنْ رَّوْحِ الدُّنْیَا وَسِعَتِھَا اِلٰی ظُلْمَۃِ الْقَبْرِ وَکَانَا یَشْہَدَانِ اَنْ لَّا اِلٰہَ اِلَّا اَنْتَ وَاَنَّ مُحَمَّداً عَبْدُکَ وَرَسُوْلُکَ وَاَنْتَ اَعْلَمُ بِھِمَا۔ اَللّٰہُمَّ تُرِکَا بِکَ وَاَنْتَ خَیْرُ مَتْرُوْکٍ بِہِمَا وَاَصْبَحَا فَقِیْرَیْنِ اِلٰی رَحْمَتِکَ وَاَنْتَ غَنِیٌّ عَنْ عَذَابِہِمَا۔ وَقَدْجِئْنَاکَ رَاغِبِیْنَ اِلَیْکَ شُفَعَآئَ لَہُمَا ۔ اَللّٰہُمَّ اِنْ کَانَتْ مُحْسِنَیْنِ فَزِدْ فِیْ اِحْسَانِہِمَا۔ وَاِنْ کَانَا مُسِیْئَیْنِ فَاغْفِرْلَھُمَا وَتَجَاوَزْ عَنْہُمَا وَلَقِّہِمَا بِرَحْمَتِکَ وَرِضَاکَ وَقِہِمَا مِنْ فِتْنَۃِ الْقَبْرِ وَعَذَابِہِ وَافْسَحْ لَھُمَا فِیْ قَبْرِھِمَا وَجَافِ الْاَرْضَ عَنْ جُنُوْبِھِمَا وَلَقِّھِمَا بِرَحْمَتِکَ الْاَمْنَ مِنْ عَذَابِکَ حَتّٰی تَبْعَثَھُمَا اِلٰی جَنَّتِکَ یَا اَرْحَمَ الرَّاحِمِیْنَ۔ اگر جنازہ دو عورتوں کے ہوں تو یوں پڑھا کریں۔ اَللّٰہُمَّ اِنَّ ھٰاتَیْنِ اَمَتَاکَ وَابْنَتَا اَمَتَیْکَ خَرَجَتَا مِنْ رَّوْحِ الدُّنْیَا وَسِعَتِھَا اِلٰی ظُلْمَۃِ الْقَبْرِ وَکَانَتَا تَشْہَدَانِ اَنْ لَّا اِلٰہَ اِلَّا اَنْتَ وَاَنَّ مُحَمَّداً عَبْدُکَ وَرَسُوْلُکَ وَاَنْتَ اَعْلَمُ بِھِمَا۔ اَللّٰہُمَّ تُرِکَتَا بِکَ وَاَنْتَ خَیْرُ مَتْرُوْکٍ بِہِمَا وَاَصْبَحَتَا فَقِیْرَتَیْنِ اِلٰی رَحْمَتِکَ وَاَنْتَ غَنِیٌّ عَنْ عَذَابِہِمَا۔ وَقَدْجِئْنَاکَ رَاغِبِیْنَ اِلَیْکَ شُفَعَآئَ لَہُمَا ۔ اَللّٰہُمَّ اِنْ کَانَتْ مُحْسِنَتَیْنِ فَزِدْ فِیْ اِحْسَانِہِمَا۔ وَاِنْ کَانَتَا مُسِیْئَٓتَیْنِ فَاغْفِرْلَھُمَا وَتَجَاوَزْ عَنْہُمَا وَلَقِّہِمَا بِرَحْمَتِکَ وَرِضَاکَ وَقِہِمَا مِنْ فِتْنَۃِ الْقَبْرِ وَعَذَابِہِ وَافْسَحْ لَھُمَا فِیْ قَبْرِھِمَا وَجَافِ الْاَرْضَ عَنْ جُنُوْبِھِمَا وَلَقِّھِمَا بِرَحْمَتِکَ الْاَمْنَ مِنْ عَذَابِکَ حَتّٰی تَبْعَثَھُمَا اِلٰی جَنَّتِکَ یَا اَرْحَمَ الرَّاحِمِیْنَ۔ اگر دو سے زیادہ جنازے ہوں اور ان میں سے کل مرد ہوں یا کچھ مرد اور ہوں تو یوں پڑھا کریں۔ اَللّٰہُمَّ اِنَّ ھٰؤُلآئِ عِبَادُکَ وَبَنُوْ عِبَادِکَ خَرَجُوْا مِنْ رَّوْحِ الدُّنْیَا وَسِعَتِھَا اِلٰی ظُلْمَۃِ الْقَبْرِ وَکَانُوْا یَشْہَدُوْنَِ اَنْ لَّا اِلٰہَ اِلَّا اَنْتَ وَاَنَّ مُحَمَّداً عَبْدُکَ وَرَسُوْلُکَ وَاَنْتَ اَعْلَمُ بِھِمْ۔ اَللّٰہُمَّ تُرِکُوْا بِکَ وَاَنْتَ خَیْرُ مَتْرُوْکٍ بِہِمْ وَاَصْبَحُوْا فُقْرَآئَ اِلٰی رَحْمَتِکَ وَاَنْتَ غَنِیٌّ عَنْ عَذَابِہِمْ۔ وَقَدْجِئْنَاکَ رَاغِبِیْنَ اِلَیْکَ شُفَعَآئَ لَہُمْ ۔ اَللّٰہُمَّ اِنْ کَانُوْا مُحْسِنِیْنَ فَزِدْ فِیْ اِحْسَانِہِمْ۔ وَاِنْ کَانُوْا مُسِیْئِیْنَ فَاغْفِرْلَھُمْ وَتَجَاوَزْ عَنْہُمْ وَلَقِّہِمْ بِرَحْمَتِکَ وَرِضَاکَ وَقِہِمْ مِنْ فِتْنَۃِ الْقَبْرِ وَعَذَابِہِ وَافْسَحْ لَھُمْ فِیْ قَبْرِھِمْ وَجَافِ الْاَرْضَ عَنْ جُنُوْبِھِمْ وَلَقِّھِمْ بِرَحْمَتِکَ الْاَمْنَ مِنْ عَذَابِکَ حَتّٰی تَبْعَثَھُمْ اِلٰی جَنَّتِکَ یَا اَرْحَمَ الرَّاحِمِیْنَ۔ اگر دو سے زیادہ عورتوں کے جنازے ہوں تو یوں پڑھا کریں۔ اَللّٰہُمَّ اِنَّ ھٰؤُلآئِ اِمَآئُ کَ وَبَنَاتُ اِمَآئِ کَ خَرَجْنَ مِنْ رَّوْحِ الدُّنْیَا وَسِعَتِھَا اِلٰی ظُلْمَۃِ الْقَبْرِ وَکُنَّ یَشْہَدْنَ اَنْ لَّا اِلٰہَ اِلَّا اَنْتَ وَاَنَّ مُحَمَّداً عَبْدُکَ وَرَسُوْلُکَ وَاَنْتَ اَعْلَمُ بِھِنَّ۔ اَللّٰہُمَّ تُرِکْنَ بِکَ وَاَنْتَ خَیْرُ مَتْرُوْکٍ بِہِنَّ وَاَصْبَحْنَ فَقِیْرَاتٍ اِلٰی رَحْمَتِکَ وَاَنْتَ غَنِیٌّ عَنْ عَذَابِہِنَّ وَقَدْجِئْنَاکَ رَاغِبِیْنَ اِلَیْکَ شُفَعَآئَ لَہُنَّ ۔ اَللّٰہُمَّ اِنْ کُنَّ مُحْسِنَاتٍ فَزِدْ فِیْ اِحْسَانِہِنَّ وَاِنْ کُنَّ مُسِیْئٓاتٍ فَاغْفِرْلَھُنَّ وَتَجَاوَزْ عَنْہُنَّ وَلَقِّہِنَّ بِرَحْمَتِکَ وَرِضَاکَ وَقِہِنَّ مِنْ فِتْنَۃِ الْقَبْرِ وَعَذَابِہِ وَافْسَحْ لَھُنَّ فِیْ قَبْرِھِنَّ وَجَافِ الْاَرْضَ عَنْ جُنُوْبِھِنَّ وَلَقِّھِنَّ بِرَحْمَتِکَ الْاَمْنَ مِنْ عَذَابِکَ حَتّٰی تَبْعَثَھُنَّ اِلٰی جَنَّتِکَ یَا اَرْحَمَ الرَّاحِمِیْنَ۔ اس دعا کے بعد چوتھی تکبیر پڑھیں۔ اس کے بعد مندرجہ ذیل دعا کو پڑھیں۔ اَللّٰھُمَّ اغْفِرْ لِحَیِّنَا وَ مَیِّتِنَا وَ شَاہِدِنَا وَ غَائِبِنَا وَ صَغِیْرِنَا وَ کَبِیْرِنَا وَ حُرِّنَا وَ عَبْدِنَا وَ ذَکَرِنَا وَ اُنْثَانَاo اَللّٰھُمَّ مَنْ اَحْیَیْتَہٗ مِنَّا فَاَحْیِہٖ عَلَی الْاِسْلَامِ وَ مَنْ تَوَفَّیْتَہٗ مِنَّا فَتَوَفَّہٗ عَلَی الْاِیْمَانِ o اس کے بعد پانچویں تکبیر پڑھ کر سلام پھیرے۔ اگر جنازہ کسی نابالغ بچے کا ہو تو چوتھی تکبیر کے بعد درج ذیل دعا کو بھی پڑھا جائے۔ اَللّٰھُمَّ اجْعَلْہُ فَرَطاً لِاَبَوَیْہِ وَ سَلَفاً وَّذُخْراً وَّ عِظَۃً وَّاعْتِبَاراً وَّشَفِیْعاً وَّ ثَقِّلْ بِہٖ مَوَازِیْنَھُمَا وَ اَفْرِغْ الصَّبْرَ عَلٰی قُلُوْبِھِمَاo اَللّٰھُمَّ لَاتُحَرِّمْنَا اَجْرَہٗ وَلَا تَفْتِنَّا بَعْدَہٗ وَاغْفِرْلَنَا وَلَہٗ۔ اگر جنازہ نابالغہ بچی کا ہو تو اس دعا کو یوں پڑھیں۔ اَللّٰھُمَّ اجْعَلْہَا فَرَطاً لِاَبَوَیْہَا وَ سَلَفاً وَّذُخْراً وَّ عِظَۃً وَّاعْتِبَاراً وَّشَفِیْعاً وَّ ثَقِّلْ بِہَا مَوَازِیْنَھُمَا وَ اَفْرِغْ الصَّبْرَ عَلٰی قُلُوْبِھِمَا o اَللّٰھُمَّ لَاتُحَرِّمْنَا اَجْرَھَا وَلَا تَفْتِنَّا بَعْدَہَا وَاغْفِرْلَنَا وَلَہَا۔ اس کے بعد پانچویں تکبیر پڑھیں اور سلام پھیریں۔ سلام پھیرنے کے بعد یوں دعا پڑھیں۔ اَللّٰھُمَّ صَلَّیْنَا ھٰذِہِ الصَّلوٰۃَ وَ قَدْ تَعْلَمُ مَا اَرَدْنَا بِھَا اَللّٰھُمَّ ابْعَثْ ثَوَابَھَا اِلٰی قَبْرِہِ بِجُوْدِکَ وَ کَرَمِکَ بِرَحْمَتِکَ یَا اَرْحَمَ الرَّاحِمِیْنَ O اگر جنازہ عورت کا ہو تو ’’الیٰ قَبْرِھَا‘‘ پڑھیں۔ مذکورہ بالا دعا پڑھنے کے بعد سورۂ فاتحہ اور سورۂ اخلاص پڑھ کر یوں دعا پڑھا کریں۔ لَا اِلٰہَ اِلَّا اللّٰہُ وَحْدَہٗ لاَشَرِیْکَ لَہٗ o لَہُ الْمُلْکُ وَلَہُ الْحَمْدُ یُحْیِیْ وَ یُمِیْتُ وَ ھُوَ حَیٌّ لَا یَمُوْتُ بِیَدِہِ الْخَیْرِ وَھُوَ عَلیٰ کُلِّ شَیْیٍٔ قَدِیْرٌ o بِسْمِ اللّٰہِ الرَّحْمٰنِ الرَّحِیْمِ o اَللّٰہُ اَکْبَرُ اَللّٰہُ اَکْبَرُ اَللّٰہُ اَکْبَرُ لَا اِلٰہَ اِلَّا اللّٰہُ وَاللّٰہُ اَکْبَرُ اَللّٰہُ اَکْبَرُ وَ لِلّٰہِ الْحَمْدُo بر سرور کائنات صلوات اَللّٰہُمَّ صَلِّ عَلیٰ مُحَمَّدٍ وَّ آلِ مُحَمَّدٍ o اَللّٰہُمَّ اغْفِرْلَنَا وَلِوَالِدَیْنَا وَ لِجَمِیْعِ الْمُؤْمِنِیْنَ وَالْمُؤْمِنَاتِ وَ الْمُسْلِمِیْنَ وَ الْمُسْلِمَاتِ اَلْاَحْیَائِ مِنْھُمْ وَ الْاَمْوَاتِ بِرَحْمَتِکَ یَا اَرْحَمَ الرَّاحِمِیْنَ۔ پھر جنازے کو اٹھاتے ہوئے یوں پڑھیں۔ بِسْمِ اللّٰہِ وَ بِا اللّٰہِ وَ عَلیٰ مِلَّۃِ رَسُوْلِ اللّٰہِ "},],"تدفین ":[{"":"جنازے کو قبر کے دہانے رکھ کر قبر میں اتارنے سے پہلے سورۂ ملک پڑھ لیں پھر ’’بِسْمِ اللّٰہِ وَ بِا اللّٰہِ وَ عَلیٰ مِلَّۃِ رَسُوْلِ اللّٰہِ‘‘ پڑھ کر قبر میں آہستہ آہستہ اتاریں۔ مردہ مرد کوقبر میں اتارتے وقت یوںنیت کی جائے۔ اُدَفِّنُ ہٰذَا الْمَیِّتَ لِوُجُوْبِہٖ قُرْبَۃً اِلیٰ اللّٰہِ۔ مردہ عورت کیلئے یوں نیت کی جائے۔ اُدَفِّنُ ہٰذِہِ الْمَیِّتَۃَ لِوُجُوْبِہٖ قُرْبَۃً اِلیٰ اللّٰہِ۔ مردے کو قبر میں اتار کر دائیں پہلو پر رکھ دیں چہرہ قبلہ کی طرف ہو اس کی پیشانی کو قبلہ کی طرف والی دیوار سے ملادیں۔ سہارے کے لئے نیچے پتھر رکھ دیں۔ پیروں کے انگوٹھوں کو کھول کر رکھیں اور تلقین پڑھتے وقت مردے کو آہستہ آہستہ ہلاتے رہیں۔ "},
                                     {"تلقین میت /سوال نکیر ومنکر":"مردے کو قبر میںاتارنے کے بعد مندرجہ ذیل طریقے پر تلقین میت پڑھا کریں۔ مرد کیلئے یوں پڑھیں۔ بِسْمِ اللّٰہِ الرَّحْمٰنِ الرَّحِیْمِ ۔ سُبْحَانَ مَنْ تَعَزَّزَ بِالْقُدْرَۃِ وَ الْبَقَائِ وَ قَھَّرَ الْعِبَادَ بِالْمُوْتِ وَالْفَنَائِ اِعْلَمْ یَا عَبْدَ اللّٰہِ اَنَّ ہٰذَا الْیَوْمَ یَوْمُ الْآخِرِ مِنْ اَیَّامِ الدُّنْیَا وَ ھٰذَا الْوَقْتَ وَقْتُ الْاَوَّلُ مِنْ اَوْقَاتِ الْعُقْبیٰ۔ فَاِنَّ الْمَوْتَ حَقٌّ وَ الْقَبْرَ حَقٌّ وَالسُّؤَ الَ حَقٌّ وَ السَّاعَۃَ حَقٌّ وَالْحَشْرَ حَقٌّ وَالصِّرَاطَ حَقٌّ وَ الْحِسَابَ حَقٌّ وَالْمِیْزَانَ حَقٌّ وَ النَّارَ حَقٌّ وَالْجَنَّۃَ حَقٌّ وَ اللِّقَائَ حَقٌّ ۔ وَ یَأتِیْکَ الرَّسُوْلَانِ مِنَ الرَّحْمٰنِ وَ یَسْئَلاَنِ مِنْکَ وَ مِنْ رَّبِّکَ وَ مِنْ دِیْنِکَ وَ مِنْ کِتَابِکَ وَ مِنْ قِبْلَتِکَ وَ مِنْ نَّبِیِّکَ وَ مِنْ اِمَامِکَ فَلَا تَخَفْ وَلَاتَحْزَنْ وَ قُلْ فِیْ جَوَابِھِمَا۔ مردہ عورت ہو تو یوں پڑھاکریں۔ بِسْمِ اللّٰہِ الرَّحْمٰنِ الرَّحِیْمِ۔ سُبْحَانَکَ مَنْ تَعَزَّزَ بِالْقُدْرَۃِ وَ الْبَقَائِ وَ قَھَّرَ الْعِبَادَ بِالْمُوْتِ وَالْفَنَائِ اِعْلَمِیْ یَا اَمَۃَ اللّٰہِ اَنَّ ہٰذَا الْیَوْمَ یَوْمُ الْآخِرِ مِنْ اَیَّامِ الدُّنْیَا وَ ھٰذَا الْوَقْتَ وَقْتُ الْاَوَّلُ مِنْ اَوْقَاتِ الْعُقْبیٰ۔ فَاِنَّ الْمَوْتَ حَقٌّ وَ الْقَبْرَ حَقٌّ وَالسُّؤَالَ حَقٌّ وَ السَّاعَۃَ حَقٌّ وَالْحَشْرَ حَقٌّ وَالصِّرَاطَ حَقٌّ وَ الْحِسَابَ حَقٌّ وَالْمِیْزَانَ حَقٌّ وَ النَّارَ حَقٌّ وَالْجَنَّۃَ حَقٌّ وَ اللِّقَائَ حَقٌّ ۔ وَ یَأتِیْکِ الرَّسُوْلَانِ مِنَ الرَّحْمٰنِ وَ یَسْئَلاَنِ مِنْکِ وَ مِنْ رَّبِّکِ وَ مِنْ دِیْنِکِ وَ مِنْ کِتَابِکِ وَ مِنْ قِبْلَتِکِ وَ مِنْ نَّبِیِّکِ وَ مِنْ اِمَامِکِ فَلَا تَخَافِیْ وَلَاتَحْزَنِیْ وَ قُوْلِیْ فِیْ جَوَابِھِمَا ۔ اس کے بعد یوں جواب تلقین پڑھیں۔ اَللّٰہُ رَبِّیْ۔ وَ الْاِسْلَامُ دِیْنِیْ۔ وَالْقُرْآنُ کِتَابِیْ۔ وَ الْکَعْبَۃُ قِبْلَتِیْ۔ وَ مُحَمَّدٌ صَلَّی اللّٰہُ عَلَیْہِ وَ آلِہٖ وَسَلَّمَ نَبِیٌّ ۔ وَ عَلِیٌّ عَلَیْہِ السَّلَامُ اِمَامِیْ (تین بار) وَ بَعْدَہُ سَیِّدُ اَوْلَادِہٖ حَسَنُ ابْنُ عَلِیٍّ ۔ ثُمَّ اَخُوْہُ السِّبْطُ التَّابِعُ لِمَرْضَاتِ اللّٰہِ الْحُسَیْنُ ۔ ثُمَّ الْعَابِدُ عَلِیٌّ۔ ثُمَّ الْبَاقِرُ مُحَمَّدٌ، ثُمَّ الْصَادِقُ جَعْفَرٌ، ثُمَّ الْکَاظِمُ مُوْسیٰ ثُمَّ الرِّضَا عَلِیٌّ ثُمَّ التَّقِیُّ مُحَمَّدٌ، ثُمَّ النَّقِیُّ عَلِیٌّ ثُمَّ الزَّکِیُّ الْعَسْکَرِیُّ الْحَسَنُ ثُمَّ مُحَمَّدُ نِ الْمَھْدِیُّ صَاحِبُ الزَّمَانِ۔ صَلَوَاتُ اللّٰہِ وَ سَلَامُہٗ عَلَیْہٖ وَ عَلَیْھِمْ اَجْمَعِیْنَ ۔ ھُمْ سَادَتِیْ وَ قَادَتِیْ وَ اَئِمَّتِیْ وَ اِمَامِیْ بِھِمْ اَتَوَلّٰی وَ مِنْ اَعْدَائِھِمْ اَتَبَرَّئُ ۔ اس کے بعد یوں دعا پڑھیں۔ اَللّٰھُمَّ اجْعَلْ قَبْرَہٗ (عورت کیلئے ’’قَبْرَھَا‘‘) رَوْضَۃً مِّنْ رِّیَاضِ الْجَنَانِ بِرَحْمَتِکَ یَا اَرْحَمَ الرَّاحِمِیْنَ ۔ بِسْمِ اللّٰہِ وَ بِا اللّٰہِ وَ عَلٰی مِلَّۃِ رَسُوْلِ اللّٰہِ ۔ اَللّٰھُمَّ اِنِّیْ اَسْئَلُکَ اَنْ لَّاتُعَذِّبْ ھَذَا الْمَیِّتَ (عورت کیلئے ’’ ھٰذٖہٖ الْمَیِّتَۃِ) بِرَحْمَتِکَ یَا اَرْحَمَ الرَّاحِمِیْنَ ۔ آخر میں فاتحہ پڑھنے کے بعد سب ملکر قبر پر مٹی ڈال کر اسے بند کریں اور پانی کا چھڑ کاؤ کرکے قبر کی مٹی کو تر کر کے قبر کی شکل بنا دے پانی چھڑکتے وقت مرد کیلئے یوں دعا پڑھیں۔ سَقَی اللّٰہُ ثَرَاہٗ وَ بَرَّدَ اللّٰہُ مَضْجَعَہٗ وَ جَعَلَ الْجَنَّۃَ مَثْوَاہٗ۔ عورت کیلئے یوں دعا کریں۔ سَقَی اللّٰہُ ثَرَاہَا وَ بَرَّدَ اللّٰہُ مَضْجَعَھَا وَ جَعَلَ الْجَنَّۃَ مَثْوَاھَا۔"},
                                     {"قبر بنانے کا طریقہ":"قبر اس طرح بنانی چاہئے کہ میت کا چہرہ دائیں پہلوپر قبلہ کی جانب ہو۔ قبر کو کشادہ اور کسی درمیانے قد کے اندازے کے مطابق گہرا بنانا سنت ہے۔ زمین کے سخت ہونے کی صورت میں اس سے کم اندازہ کافی ہے۔ اوپر سے سیدھا کھودنا اور لحد بنانا دونوں صورتیں جائز ہیں۔ زمین کی سختی اور اس کی نرمی کے مدنظر یا کسی مصلحت کی بناء پر بعض جگہ اوپر سے سیدھا کھودنااور بعض جگہ لحد کی شکل کا بنانا بہترہے۔ قبر کو زمین سے ایک بالشت کے اندازے کے برابر بلند کیا جائے، قبر کو ہموار بنانا اور گنبدنما بنانا دونوں جائز ہیں۔ "},
                                     {"اسلام میں قبر کی اہمیت":"ثُمَّ اَمَاتَہٗ فَاَقْبَرَہٗ (عبس) ترجمہ :۔ اس کے بعد اسے مار دیا اور قبر میں دفن کیا۔ اسلام میں یہ حکم ہے کہ انسان کو مرنے کے بعد قبر بناکر اس میں دفن کیا جائے۔ انسان کو قبرمیں دفنانے کی تاریخ حضرت آدم ؑ کے زمانے سے ہی شروع ہوئی۔ پہلی مرتبہ قابیل نے حضرت ہابیل کو قتل کرنے کے بعد قبر بناکر دفنایاتھا۔ قبر کے احترام کے حوالے سے میر سید محمد نوربخش ؒ نے فرمایا کہ قبر کا اسی طرح احترام کیا جائے جس طرح زندہ ہونے کی حالت میں صاحب قبر کا احترام کیا جاتا تھا۔چنانچہ انبیاء علیہم السلام، ائمہ معصومین علیہم السلام اور اولیاء کرام ؒ کی قبریں نہایت قابل احترام اور مقدس مقامات ہیںان کا احترام تمام مسلمانان عالم پر واجب ہیں۔ "},
                                     {"نماز فدیہ میت":"نماز فدیۂ میت مردے کو دفنانے کے دن سے لے کر چالیسویں تک پڑھی جاتی ہے۔ ایک مُردہ مرد کے لئے نیت یوں کرے۔ اُصَلِّیْ صَلٰوۃَ فِدْیَۃِ الْمَیِّتِ رَکْعَتَیْنِ قُرْبَۃً اِلَی اللّٰہِ عورت کے لئے فِدْیَۃِ الْمَیِّتَِۃِ دو مردوں کیلئے : فِدْیَۃِ الْمَیِّتَیْنِ دو عورتوں کے لئے فِدْیَۃِ الْمَیِّتَتَیْنِ دو سے زیادہ مردوں کیلئے : فِدْیَۃِ الْاَمْوَاتِ پہلی رکعت میں فاتحہ کے بعد آیۃ الکرسی ایک مرتبہ اور سورۂ اخلاص تین مرتبہ اور دوسری رکعت میں سورۂ فاتحہ کے بعد سورۂ تکاثر تین مرتبہ پڑھی جاتی ہے۔ قعدۂ خفیفہ میں مرد کے لئے اَللّٰہُمَّ اجْعَلْ قَبْرَہٗ (عورت کے لئے) قَبْرَھَا ۔ رَوْضَۃً مِّنْ رِّیَاضِ الْجَنَانِ یا وَلَاتَجْعَلْ قَبْرَہٗ (ھَا) حُفْرَۃً مِنْ حُفَرِ النِّیْرَانِ پڑھیںپھر سلام پھیر کر فاتحہ خوانی کرے۔ "},],
          "مخصوص مسائل":[{"شہید کا مسئلہ":"شہید وہ شخص ہے جو راہ خدا میں لڑتے ہوئے کافروں کے ہاتھوں مارا جائے ،یا مسلمانوں کے ہاتھوں ظلم سے قتل ہوا ہو۔ شہید کے لئے غسل اور کفن کی ضرورت نہیں ہوتی۔ اسے اپنے ہی خود آلود کپڑوں میں دفنایا جاسکتا ہے بصورت دیگر کفن کا استعمال بھی درست ہے۔ اس کے جسم سے صرف جوتے اور ہتھیار وغیرہ الگ کریں۔ نماز جنازہ پڑھانا ممکن ہو تو پڑھ لیں ورنہ بغیر نماز جنازہ کے دفنانا بھی درست ہے۔"},
                        {"نومولود بچہ کا مسئلہ":"نومولود بچہ کو غسل دینا ، کفن (صرف ایک کپڑے میں لپیٹ کر )پہنانا اور دفنانا واجب ہے۔ جبکہ نماز جنازہ پڑھنا سنت ہے۔ مردہ حالت میں پیدا ہونے والے بچے کی نماز جنازہ ضروری نہیں ہے۔"},
                        {"کٹے ہوئے اعضاء کا مسئلہ":"اگر کہیں سے انسانی اعضاء ملے تو اس کو دفنانا لازمی ہے جبکہ دیگر تمام شرعی احکامات ساقط ہے۔ پانی میں ڈوب کے مرنے والے کا مسئلہ اگر کوئی شخص پانی میں ڈوب کر مرجائے تو اس کو ناپاکی وغیرہ کودور کرنے کی غرض سے دھونے کی ضرورت نہیں،مگر باقی واجبی غسل اور سنتی غسل وغیرہ اور باقی تمام احکامات اسی طرح لاگو ہوں گے۔ آگ میں جھلس کر مرنے والے کا مسئلہ آگ میں جھلس کر مرنے والے کو غسل دینا ممکن نہ ہوا تو تیمم کریں اور باقی احکامات بھی بجالائیں۔ "},
                        {"میت کے ایصال ثواب کیلئے":"حضرت میر سید محمد نوربخش علیہ الرحمہ فقہ احوط باب صلوٰۃ میں فرماتے ہیں۔ کسی قریبی شخص کی انتقال پر اس اس کے عزیز واقارب کے لئے تین دنوں تک سوگ منانا سنت ہے۔میت کو ثواب پہنچانے کی خاطر پہلی رات،تیسرے دن ، ساتویں دن یا چالیسویں کے موقع پر علماء ، نیک لوگوں،فقراء ، مساکین اور یتیموں کو کھانا کھلانا صاحب استطاعت پر سنت ہے۔ اسی طرح قرآن خوانی کرنا، نماز پڑھنا ، دعائیں مانگنا ، مسجدیں،مدرسے، خانقاہیں، پل اور تالابوں کا بنانا،فی سبیل اللہ جائیداد وقف کرنااور دیگر تمام خیراتی کام کرنا سنت ہیں۔ ان تمام خیراتی کاموں میں نیت ،میت کی روح کے لئے ثواب پہنچانے کی غرض سے ہو تو اللہ تعالیٰ ان کا ثواب میت تک پہنچاتا ہے۔ ان خیراتی کاموں کو میت کے قبر کے قریب کرنا لازمی نہیں ہے بلکہ جہاں کہیں وقوع پذیر ہو،چاہئے دور ہوں یا نزدیک ان کا ثواب میت کو پہنچ ہی جاتا ہے ۔ آپ ؒ فقہ احوط باب اجارہ میں مزید فرماتے ہیں۔ میت سے فوت شدہ عبادتوں کی بجاآوری کے لئے کسی کو اجرت پر لینا درست ہے۔ مثلاً حج، روزہ اور نماز وغیرہ ، اجیر کے ذمے جس کی خاطر اس کو اجرت پر لیا گیا ہو اس کی طرف سے عبادتوں کا ایسا ہی بجالانا واجب ہے جیساکہ وہ فوت ہوچکی ہوں۔ جو بھی عبادت ، اجیر شخص میت کی نیت سے بجالائے گا اور اس عبادت کی اجرت وصول کرے گا تو عبادت خود اسی کی طرف سے وقوع پذیر ہوگی اور عبادتوں کا ثواب میت کو پہنچے گا۔ جیساکہ احادیث نبوی ؐ میں وارد ہے اور اللہ تعالیٰ کے ان اہل کشف اولیائے کرام ؒ کے مشاہدے سے ثابت ہے جو صدقات ، خیرات اور وقوع پذیر ہونے والی عبادتوں کے ثواب کو دیکھ لیتے ہیں کہ وہ کیسے اموات کے ارواح کو پہنچتے ہیں۔ "},
                        {"نماز نیابت":"میت کی قضاء شدہ نمازوں کو اس کی موت کے بعد قضاء کے طور پر پڑھی جاسکتی ہے۔ والد کی نیابت والی نماز کیلئے نیت یوں کی جائے۔ اُصَلِّیْ فَرْضَ الصُّبْحِ قَضَآئً نِیَابَۃً عَنْ اَبِیْ لِوُجُوْبِہٖ قُرْبَۃً اِلَی اللّٰہِ والدہ کیلئے نِیَابَۃً عَنْ اُمِّیْ ‘ دادا کیلئے نِیَابَۃً عَنْ جَدِّیْ ‘ دادی کیلئے نِیَابَۃً عَنْ جَدَّتِیْ ‘ بھائی کیلئے نِیَابَۃً عَنْ اَخِیْ ‘ بہن کیلئے نِیَابَۃً عَنْ اُخْتِیْ بیٹے کیلئے نِیَابَۃً عَنْ اِبْنِیْ‘ بیٹی کیلئے نِیَابَۃً عَنْ اِبْنَتِیْ ‘ اجنبی مرد نِیَابَۃً عَنْ فلان ابن فلان ‘ عورت کیلئے نِیَابَۃً عَنْ فلانۃ بنت فلان پڑھا جائے۔ اگر رشتہ داروں میں سے کوئی نیابت کرنے والا نہ ہو تو کسی اور کو اجرت دے کر بھی نماز پڑھوائی جاسکتی ہے۔ اجرت کی تعداد وارث اور اجرت پر نماز پڑھنے والے دونوں کی رضامندی سے طے کریں۔ بعض بزرگان دین کے قول کے مطابق فی نماز کم از کم ایک کلو گندم سے کم اجرت نہیں ہونی چاہئے۔ "},
                        {"زیارت قبور کے افضل ایام":"امیر المؤمنین حضرت علی علیہ السلام سے روایت ہے کہ حضور اکرم ؐ نے فرمایا ہفتے میں قبروں کی زیارت کرنا مستحب ہے۔ زیارت کے لئے چار دن ہفتہ کے دیگر ایام سے بہتر ہیں۔ جمعہ کے دن بعد از نماز جمعہ ،ہفتہ کے دن سورج نکلنے تک، پیر کے دن شام کے وقت، جمعرات کے دن اول وقت میں قبرستان جانا بہتر ہے۔ اسی طرح بابرکت راتوں اور بابرکت دنوں میں زیارت قبور کے لئے قبرستان جانا ثواب ہے۔ مثلاً شب قدر، شب برأت، شب رغائب، عیدالفطر اور عید الاضحی کے روز اور عاشورہ کے دن زیادہ بہتر ہے۔ "},
                        {"قبور کی زیارت اور نماز مقبرہ":"امیر المؤمنین حضرت علی علیہ السلام کا فرمان ہے ’’اگر کوئی کسی کی قبر پر جاکر یہ دعا پڑھے۔ اَللّٰہُمَّ اغْفِرْلَنَا وَلَہٗ (عورت کے لئے وَلَھَا) بِحَقِّ مُحَمَّدٍ وَاَھْلِ بَیْتِ مُحَمَّدٍ ط پھر سورۂ فاتحہ ایک مرتبہ ‘ آیۃ الکرسی ایک مرتبہ ‘ سورۂ قدر ایک مرتبہ‘ سورۂ نصر دس مرتبہ سورۂ اخلاص دس مرتبہ ‘ درود شریف دس مرتبہ اور اَسْتَغْفِرُ اللّٰہَ الْعَظِیْمَ دس مرتبہ پڑھے۔ تو اللہ تعالیٰ اس مردے کو قیامت تک سیراب کریگا یہاں تک کہ قیامت کے دن اس کو محشور کیا جائے گا۔ یہ نماز دو رکعت پڑھی جاتی ہے۔ جس کسی مردے کی خاطر پڑھی جائے اس کو بڑا اجر ملے گا۔ مذکورہ نماز کی دونوں رکعتوں میں سورۂ فاتحہ کے بعد آیۃ الکرسی اور سورۂ اخلاص ایک ایک مرتبہ اور سورۂ تکاثر دس دس مرتبہ پڑھی جاتی ہے۔ بعد از سلام بسم اللہ اور درود شریف پڑھ کر درج ذیل دعاکو بھی پڑھا کریں۔ اَللّٰہُمَّ صَلَّیْتُ الصَّلوٰۃَ وَقَدْ تَّعْلَمُ مَا اَرَدْتُّ بِھَا اَللّٰہُمَّ ابْعَثْ ھٰذِہِ ثَوَابَھَا اِلیٰ قَبْرِہٖ (عورت کے لئے قَبْرِھَا) بِرَحْمَتِکَ یَا اَرْحَمَ الرَّاحِمِیْنَ۔ نماز مقبرہ کی نیت یوں کی جائے۔ اُصَلِّیْ صَلٰوۃَ الْمَقْبَرَۃِ رَکْعَتَیْنِ قُرْبَۃً اِلَی اللّٰہِط "},
                        {"نماز زیارت والدین":"اگرکوئی اپنے والدین کی قبور کی زیارت کے لئے جانا چاہے تو زیارت کو جانے سے پہلے اپنے گھر میں دو رکعت نماز زیارت پڑھے۔ ہر ایک رکعت میں سورۂ فاتحہ کے بعد آیۃ الکرسی ایک مرتبہ اور سورۂ اخلاص تین مرتبہ پڑھے ۔ نیت یہ ہے ۔ اُصَلِّیْ صَلٰوۃَ الزِّیَارَۃِ رَکْعَتَیْنِ قُرْبَۃً اِلَی اللّٰہِ ط جب نماز سے فارغ ہوجائے تو قبرستان چلا جائے راستے میں کوئی غیر ضروری کام نہ کرے۔ جب قبرستان پہنچ جائے تو اپنے جوتوں کو اتاردے اور پیٹھ قبلہ کی طرف اور منہ قبر کی طرف کرکے سلام ذیل پڑھیں۔ اَلسَّلَامُ عَلَیْکُمْ یَا اَھْلَ الْقُبُوْرِ وَرَحْمَۃُ اللّٰہِ وَبَرَکَاتُہٗ یَغْفِرُ اللّٰہُ لَنَا وَلَکُمْ وَاَنْتُمْ لَنَا سَلَفٌ وَنَحْنُ بِکُمْ تَبَعٌ اَلسَّلَامُ عَلیٰ اَھْلِ لَا اِلٰہَ اِلَّا اللّٰہُ مِنْ اَھْلِ لَا اِلٰہَ اِلَّا اللّٰہُ یَا اَھْلَ لَا اِلٰہَ اِلَّا اللّٰہُ کَیْفَ وَجَدْتُّمْ قَوْلَ لَا اِلٰہَ اِلَّا اللّٰہُ ط یَا مَنْ لَا اِلٰہَ اِلَّا اللّٰہُ ط اِغْفِرْ لِمَنْ قَالَ لَا اِلٰہَ اِلَّا اللّٰہُ ط وَاحْشُرْنَا فِیْ زُمْرَۃِ مَنْ قَالَ لَا اِلٰہَ اِلَّا اللّٰہُ مُحَمَّدٌ رَّسُوْلُ اللّٰہِ عَلِیٌّ وَّلِیُّ اللّٰہِ ط اس نماز زیارت اور دعائے زیارت کی وجہ سے اللہ تعالیٰ مردے کی قبر میں ایک ہزار نور بھیجتا ہے اور نماز زیارت پڑھنے والے کے نامۂ اعمال میں حج اور عمرہ کثیرہ کی ادائیگی کا ثواب لکھ دیا جاتاہے۔ حضور ؐ کا ارشاد ہے کہ جب کوئی قبرستان سے گزرے تو کلمۂ توحید پڑھے۔ اللہ تعالیٰ ان قبروں کو روشن فرماتا ہے اور ان کے گناہوں کو معاف کردیئے جاتے ہیں اور پڑھنے والے کے لئے دس لاکھ نیکیاں اس کے نامۂ اعمال میں لکھ دی جاتی ہیں۔ دس لاکھ برائیاں مٹادی جاتی ہیں۔ اہل قبور اور پڑھنے والے کو ایک ایک ہزار درجات عطا کئے جاتے ہیں۔ "},
                        {"درود اکبر اور اس کی فضیلت":"اگر کوئی درود اکبر کو کسی قبرستان میں ایک مرتبہ پڑھے تو اس قبرستان والوں سے تیس سال تک عذاب کو اٹھادیا جاتا ہے۔ اگر دو مرتبہ پڑھے تو چالیس سال کے عذاب کو بخش دیا جاتا ہے۔اگر چار مرتبہ درود اکبر پڑھے تو قیامت تک کے لئے اہل قبور سے عذاب کوہٹایا جائے گا اور اگر آٹھ بار پڑھے تو جو بھی نیا مرنے والا اس قبرستان میں دفنایا جائے اسے بھی عذاب نہ ہوگا۔ اس کی برکت سے والدین کے حقوق اولاد سے ادا ہوجائیںگے۔ درود اکبر یہ ہے۔ بسم اللہ الرحمن الرحیم اَللّٰہُمَّ صَلِّ عَلٰی مُحَمَّدٍ وَّآلِ مُحَمَّدٍ وَبَارِکْ وَسَلِّمْ عَلَیْہِمْ اَللّٰہُمَّ صَلِّ عَلٰی مُحَمَّدٍ وَّآلِ مُحَمَّدٍ مَادَامَتِ الصَّلٰوۃُ وَصَلِّ عَلٰی مُحَمَّدٍ وَّآلِ مُحَمَّدٍ مَّادَامَتِ الْبَرَکَاتُ وَصَلِّ عَلٰی مُحَمَّدٍ وَّآلِ مُحَمَّدٍ مَّادَامَتِ الرَّحْمَۃُ اَللّٰہُمَّ صَلِّ عَلٰی رُوْحِ مُحَمَّدٍ وَّآلِ مُحَمَّدٍ فِی الْاَرْوَاحِ وَصَلِّ عَلٰی نَفْسِ مُحَمَّدٍ وَّآلِ مُحَمَّدٍ فِی النُّفُوْسِ وَصَلِّ عَلٰی تُرْبَۃِ مُحَمَّدٍ وَّآلِ مُحَمَّدٍ فِی التُّرَابِ وَصَلِّ عَلٰی قَلْبِ مُحَمَّدٍ وَّآلِ مُحَمَّدٍ فِی الْقُلُوْبِ وَصَلِّ عَلٰی قَبْرِ مُحَمَّدٍ وَّآلِ مُحَمَّدٍ فِی الْقُبُوْرِ وَصَلِّ عَلٰی جَسَدِ مُحَمَّدٍ وَّآلِ مُحَمَّدٍ فِی الْاَجْسَادِ وَصَلِّ عَلٰی رَوْضَۃِ مُحَمَّدٍ وَّآلِ مُحَمَّدٍ فِی الرِّیَاضِ وَصَلِّ عَلٰی اِسْمِ مُحَمَّدٍ وَّآلِ مُحَمَّدٍ فِی الْاَسْمَآئِ وَصَلِّ عَلٰی صُوْرَۃِ مُحَمَّدٍ وَّآلِ مُحَمَّدٍ فِی الصُّوَرِ وَصَلِّ عَلٰی نُوْرِ مُحَمَّدٍ وَّآلِ مُحَمَّدٍ فِی الْاَنْوَارِ وَصَلِّ عَلٰی جِسْمِ مُحَمَّدٍ وَّآلِ مُحَمَّدٍ فِی الْاَجْسَامِ وَصَلَّی اللّٰہ عَلٰی خَیْرِ خَلْقِہٖ مُحَمَّدٍ وَّآلِہٖ وَاَصْحَابِہٖ وَاَزْوَاجِہٖ وَاَوْلَادِہٖ وَاَھْلِ بَیْتِہِ الطَّاہِرِیْنَ بِرَحْمَتِکَ یَا اَرْحَمَ الرَّاحِمِیْنََ درود پڑھ چکنے کے بعد قبر کی مشرقی جانب جاکر قبلہ کی طرف منہ کرکے یہ دعا پڑھیں۔ اَللّٰہُمَّ اغْفِرْلِیْ وَلِوَالِدَیَّ وَلِجَمِیْعِ الْمُؤْمِنِیْنَ وَالْمُؤْمِنَاتِ وَالْمُسْلِمِیْنَ وَالْمُسْلِمَاتِ۔ اِغْفِرْ ذُنُوْبِیْ وَتَجَاوَزْ عَنِّیْ سَیِّئَاتِیْ بِرَحْمَتِکَ یَا اَرْحَمَ الرَّاحِمِیْنَ ۔ "},
                        {"مزارات مقدسہ کی زیارت کا ثواب":"عام قبرستان میں زیارت کیلئے جانے اور درود اکبرپڑھنے کا اتنا زیادہ ثواب ہے تو انبیاء عظام ؑ اور ائمہ معصومین ؑ ودیگر بزرگان دین کے مزارات مقدس پر جانا اور نماز زیارت پڑھنے کا ثواب حد سے زیادہ ہے۔ ان مزارات مقدسہ کی زیارت کی فضیلت کے سلسلے میں کثیر تعدا د میں احادیث مروی ہیں۔ چنانچہ حضرت امیر کبیرسید علی ہمدانیؒ نے مودۃ القربیٰ میں حضرت ؔعائشہ ؓسے مروی یہ حدیث روایت کی ہے کہ پیغمبر اسلام ؐ نے فرمایا کہ جو کوئی شہر طوس (مشہد) میں جا کر میرے فرزند کی زیارت کرے گا اس کو یہ ثواب ہو گا کہ گویا اس نے ایک حج خانہ کعبہ کا کیا۔ عائشہؓ نے متعجب ہوکر عرض کی کہ ایک حج کا ثواب ملے گا؟ آپؐ نے فرمایا بلکہ دو حج کا ثواب ملے گا۔ عائشہ ؓ نے پھر تعجب سے عرض کی دوحج کا ثواب ملے گا؟ حضرتؐ نے فرمایا کہ بلکہ تین حج کا ثواب اس کو ملے گا۔ یہ سن کر ام المومنین ؓ خاموش ہوگئیں۔ حضرت ؐ نے فرمایا کہ اے عائشہ اگر تم خاموش نہ ہوتی تو میں ستر حج تک پہنچتا۔ امام علی رضاؑ کا فرمان ہے کہ جو کوئی قبر حسین ؑکی زیارت کرے گا اللہ اس شخص کیلئے ایک حج کے برابر ثواب لکھ دیتا ہے۔ امام جعفر صادقؑ فرماتے ہیںکہ جو کوئی غریب خراسان امام علی رضاؑ کی قبر کی زیارت کو جائے گا اللہ تعالیٰ اس شخص کو قبل فتح مکہ راہ خدا میں مال خرچ کرنیوالے اور جہاد کرنے والے کے برابر اجر دے گا۔ حضرت علی ں کا فرمان ہے کہ جو کوئی قبر غریب خراسان(امام علی رضاؑ )کی زیارت کرے گا اس کے اگلے پچھلے سارے گناہ معاف کر دئیے جائیں گے خواہ وہ ستاروں کے برابر یا بارش کے قطروں یا درختوں کے پتوں کے برابر ہی کیوں نہ ہو۔ یہی وجہ ہے کہ دعوات صوفیہ امامیہ کے قلمی نسخوں میں بھی مخصوص زیارات کی نمازوں کی ادائیگی کا حکم ہے۔ "},
                        {"روضۂ رسول ؐ کی زیارت کا حکم اور طریقہ":"فقہ الاحوط میں حضرت میرسید محمد نوربخشؒ کا فرمان ہے کہ حجاج کرام کیلئے حج کی سعادت حاصل کرنے کے بعد روضہ رسول ؐ کی زیارت سنت ہے۔کیونکہ روضہ رسول ؐ بھی حرم ہے۔ مدینہ منورہ میں داخل ہونے سے پہلے غسل کرنا، صاف کپڑے پہنا، انتہائی عاجزی، انکساری اور خلوص سے مسجد نبوی میں داخل ہوتے وقت یہ دعاپڑھنا مسنون افعال ہیں۔ بِسْمِ اللّٰہِ وَ بِا اللّٰہِ وَالسَّلَامُ عَلٰی رَسُوْلِ اللّٰہِ اَللّٰہُمَّ اغْفِرْلِیْ ذُنُوْبِیْ وَافْتَحْ لِیْ اَبْوَابَ رَحْمَتِکَ رَبِّ اَدْخِلْنِیْ مُدْخَلَ صِدْقٍ وَاَخْرِجْنِیْ مُخْرَجَ صِدْقٍ وَاجْعَلْ لِیْ مِنْ لَّدُنْکَ سُلْطَاناً نَصِیْراً ۔ منبر رسول ؐ کے پاس دو رکعت نماز ادا کرے۔ تربت پاک کی زیارت کرے۔ قبلہ کی طرف پیٹھ کرکے قبر رسول ؐ کے روبرو کھڑے ہوکر یوں زیارت پڑھے۔ اَلسَّلَامُ عَلَیْکَ یَا رَسُوْلَ اللّٰہِ اَلسَّلَامُ عَلَیْکَ یَا حَبِیْبَ اللّٰہِ اَلسَّلَامُ عَلَیْکَ یَا نَبِیَّ اللّٰہِ اَلسَّلَامُ عَلَیْکَ یَا خَیْرَ خَلْقِ اللّٰہِ اگر کسی نے حضور علیہ الصلوۃ والسلام کو اپنا سلام پہنچانے کی وصیت کی ہوتو اس صورت میں زائر یوں کہے۔ اَلسَّلَامُ عَلَیْکَ مِنْ فَلَانٍ (سلام بھیجنے والے کا نام لیا جائے) بعدازاں جو کچھ چاہے دعا مانگے جب تک مدینہ منورہ میں مقیم ہو حضور اکرم ؐ کی درگاہ شریف میں وقتاً فوقتاً حاضری دینے کو لازم رکھے اور ہر ممکن صورت سے مال کی خیرات کرے۔ "},
                        {"نماز مغفرت والدین":"یہ نماز عشاء کے بعد دو رکعت پڑھی جاتی ہے۔ دونوں رکعتوں میں سورۂ فاتحہ کے بعد آیت الکرسی پانچ مرتبہ اور چاروں قل (قل ھواللہ ‘ قل یا ایھا الکافرون ‘ قل اعوذ برب الفلق ‘ قل اعوذ برب الناس) پانچ پانچ مرتبہ پڑھی جاتی ہے۔ بعد از سلام اَسْتَغْفِرُ اللّٰہَ الْعَظِیْمَ پندرہ مرتبہ اور درود شریف دس مرتبہ اور رَبِّ ارْحَمْھُمَا کَمَا رَبَّیَانِیْ صَغِیْراً سو مرتبہ پڑھے اور سجدۂ شکر میں جاکر بھی آیت مذکورہ رَبِّ ارْحَمْھُمَا الخ کو ستر مرتبہ پڑھے۔ پھر رَبَّنَا اغْفِرْلِیْ وَلِوَالِدَیَّ وَلِلْمُؤْمِنِیْنَ یَوْمَ یَقُوْمُ الْحِسَابِ پڑھی جائے۔ اس نماز کی بجاآوری سے اللہ تعالیٰ والدین کے گناہوں کو بخش دیتا ہے نیز نماز پڑھنے والے سے والدین کے حقوق ادا ہوجاتے ہیں۔ نیت یہ ہے۔ اُصَلِّی رَکْعَتَیْنِ لِمَغْفِرَۃِ الْوَالِدَیْنِ قُرْبَۃً اِلَی اللّٰہِ ۔"}]}
  ],
    pgno: 0,
    contentControlling: [],
    indexDisplay: 'flex',
    noOfWords : 5,
    searchstate: false,
    searching: '',
    searchingcount: -1
    }
  }
  onSwipeLeft(){
    if(this.state.pgno>0)
    this.setState({pgno: --this.state.pgno})
    if(this.state.searchstate)
    {
      this.setState({searchingcount: --this.state.searchingcount})
    }
    if(this.state.pgno===0)
    {
      this.setState({indexDisplay: 'flex'})
    }
  }
  onSwipeRight()
  {
    this.setState({pgno: ++this.state.pgno})
    if(this.state.searchstate)
    {
      this.setState({searchingcount: ++this.state.searchingcount})
    }
    if(this.state.pgno===1)
    {
      this.setState({indexDisplay: 'none'})
    }
  }
  onSearch()
  {
    for(var i = 0; i < this.state.contentControlling.length; i++)
    {
      if(this.state.contentControlling[i].props.children.props.children.includes(" "+ this.state.searching.trim()))
      {
        if(this.state.searchingcount >= parseInt(i/15)+1)
        {
          i = (15 * (1 + parseInt(i/15))) - 1;
          continue;
        }
        this.onIndexPress(parseInt(i/15)+1)
        this.setState({searchingcount: parseInt(i/15)+1})
        break;
      }
    }
  }
  onSearch1(text)
  {
    for(var i = 0; i < this.state.contentControlling.length; i++)
    {
      if(this.state.contentControlling[i].props.children.props.children === " " + text)
      {
        this.onIndexPress(parseInt(i/15)+1)
        break;
      }
    }
  }
  onIndexPress(pgno)
  {
    this.setState({pgno: pgno, indexDisplay: 'none'})
  }
  componentDidMount()
  {
    let screenWidth = Math.round(Dimensions.get('window').width);
    let arabiletters = [1648, 1731, 1611, 1614, 1615, 1612, 1617, 1616, 1603, 1622, 1623]
    this.state.books.map((items,index)=>
    Object.keys(items).map((titles,indexes)=>
    {
      let temp = titles.split(' ');
      for(var i = 0; i < temp.length; i++)
      {
        let temp2 = ""
        for(var j = i; j < i+this.state.noOfWords ; j++)
        {
          if(j>=temp.length)
              break;
          temp2 += " " + temp[j];
          
        }
        i=i+this.state.noOfWords;
        this.state.contentControlling.push(<View><Text style={styles.heading}>{temp2}</Text></View>)
      }
      items[titles].map((objhead)=>
      Object.keys(objhead).map((keys)=>{
        {
          if(keys)
          {
          temp = keys.split(' ');
          let temp3;
          console.log(temp)
          for(var i = 0; i < temp.length; i++)
          {
           temp3="";
           for(var j = i; j<i+6; j++)
           {
            if(j>=temp.length)
            break;
             temp3 += " "+ temp[j]; 
             
           }
           i=i + 5;
           this.state.contentControlling.push(<View><Text style={styles.subheading}>{temp3}</Text></View>)
          } 
        }
           temp = objhead[keys].split(' ');
          let temp3;
          let arabicount;
         for(var i = 0; i < temp.length; i++)
         {
           temp3="";
           let count = 0;
           arabicount = 0;
           let wordsCount = this.state.noOfWords;
           var j;
           for(j = i; j<i+wordsCount; j++)
           {
             count++;
             if(j>=temp.length)
             break;
             if(temp[j] !== " ")
             temp3 += " "+ temp[j];
             for(var c = 0; c < temp[j].length; c++)
             {
              if(temp[j][c] === 'ا' || temp[j][c] + temp[j][c+1] == 'آ' || (temp[j][c] === 'ل' && temp[j][c+1] && temp[j][c+1] !== ' '))
              {
                arabicount += 0.5;
              }
              else if((temp[j][c] === 'ب' || temp[j][c] ===   'ت' || temp[j][c] === 'ف' || temp[j][c] === 'س' || temp[j][c] === 'ض' || temp[j][c] === 'ش' || temp[j][c] === 'ک' || temp[j][c] === 'ی'  || temp[j][c] === 'ے') && temp[j][c+1] && (temp[j][c+1] === ' ' || temp[j][c+1] === 'ہ'))
              {
                arabicount -= 0.8
              }
              console.log(temp[j][c])
              for(var d = 0; d < arabiletters.length; d++)
                {
                  if(temp[j][c].charCodeAt(0) == arabiletters[d])
                  {
                    arabicount++;
                    break;
                  }
                }
              }
              if(temp3.length-arabicount>25)
              {
                wordsCount = count
                break;
              }

           }
           let tempcount = 0;
           if(j < i + wordsCount)
           {
              j++;
           }
           if(temp[j]!==undefined)
           for(var c = 0; c < temp[j].length; c++)
              {
              if(temp[j][c] === 'ا' || temp[j][c] + temp[j][c+1] === 'آ' || (temp[j][c] === 'ل' && temp[j][c+1] && temp[j][c+1] !== ' '))
              {
                tempcount += 0.5;
              }
              else if((temp[j][c] === 'ب' || temp[j][c] ===   'ت' || temp[j][c] === 'ف' || temp[j][c] === 'س' || temp[j][c] === 'ض' || temp[j][c] === 'ش' || temp[j][c] === 'ک' || temp[j][c] === 'ی'  || temp[j][c] === 'ے') && temp[j][c+1] && (temp[j][c+1] === ' ' || temp[j][c+1] === 'ہ'))
              {
                tempcount -= 0.8
              }
              for(var d = 0; d < arabiletters.length; d++)
                {
                  if(temp[j][c].charCodeAt(0) == arabiletters[d])
                  {
                    tempcount++;
                    console.log(temp[j], " me ", temp[j][c])
                    break;
                  }
                }
              }

           while(temp[j]!==undefined && (temp3.length - arabicount + temp[j].length - tempcount) <= parseInt(screenWidth / 10.9) && i<temp.length)
           {
             arabicount += tempcount;
             if(temp[j] !== ' ')
             temp3 += " " + temp[j++];
             wordsCount++;
             tempcount = 0;
           if(temp[j]!==undefined)
           for(var c = 0; c < temp[j].length; c++)
              {
              if(temp[j][c] === 'ا' || temp[j][c] === 'آ' || (temp[j][c] === 'ل' && temp[j][c+1] && temp[j][c+1] !== ' '))
              {
                tempcount += 0.5;
              }
              else if((temp[j][c] === 'ب' || temp[j][c] ===   'ت' || temp[j][c] === 'ف' || temp[j][c] === 'س' || temp[j][c] === 'ض' || temp[j][c] === 'ش' || temp[j][c] === 'ک' || temp[j][c] === 'ی'  || temp[j][c] === 'ے') && temp[j][c+1] && (temp[j][c+1] === ' ' || temp[j][c+1] === 'ہ'))
              {
                tempcount -= 0.8
              }
                for(var d = 0; d < arabiletters.length; d++)
                {
                  if(temp[j][c].charCodeAt(0) == arabiletters[d])
                  {
                    tempcount++;
                    break;
                  }
                }
              }

           }
           i=i+wordsCount-1;
           this.state.contentControlling.push(<View><Text style={styles.para}>{temp3}</Text></View>)
         }
       }
      })
    )
    })
    )

  }
  render()
  {
    const config = {
      velocityThreshold: 0.0,
      directionalOffsetThreshold: 80
    };
    
    const screenHeight = Math.round(Dimensions.get('window').height);
    return (
      <Container style={{backgroundColor: 'white'}}>
      <Header>
          <Left width='50%' style={{display: 'flex', flex: 0.3}}>
            <Button transparent>
              <Icon name='menu' />
            </Button>
          </Left>
          <Body style={{width: '250%'}}>
            {(!this.state.searchstate ?
              <Title style={{paddingLeft: 10}}>Header</Title>:
              <TextInput placeholder="Search" style={{paddingLeft: 20, paddingRight: 40,backgroundColor: 'white',height: '70%', width: '200%'}} value={this.state.searching} onChangeText={(e)=>this.setState({searching: e, searchingcount: -1})} onBlur={()=>this.onSearch()} />
            )}
          </Body>
          <Right style={{backgroundColor: 'transparent', width: '30%'}}>
            <Button transparent onPress={()=>{ if(this.state.searchstate)this.setState({searching: ''});this.setState({searchstate: !this.state.searchstate});}}>
              {(!this.state.searchstate ? <Icon name='search' /> : <Icon name='close' style={{color: 'black'}} />)}
            </Button>
          </Right>
        </Header>        
        <GestureRecognizer
        onSwipeLeft={()=>this.onSwipeLeft()}
        onSwipeRight={()=>this.onSwipeRight()}
        config={config}
        style={{
          position:'relative',
          zIndex: 2,
        }} >
          <View style={{borderWidth: 3,padding: '2.6%',paddingBottom: '3%', height: '95.6%', overflow: 'hidden', paddingVertical: 'auto'}}>
            <View style={{borderWidth: 3, padding: '2.5%', paddingBottom: '1.7%', height: '100%', overflow: 'hidden',}}>
              <View style={{marginTop: '1%', height: '98%',alignItems: 'center', overflow: 'hidden', marginBottom: 30}}>
                  <View style={{height: screenHeight-143 ,display: this.state.indexDisplay, position: "relative", zIndex: 2}}>
                    <Text style={styles.heading}>فہرست:</Text>
                    {Object.keys(this.state.books[0]).map((titles, index)=>
                      <Text onPress={()=>this.onSearch1(titles)} style={styles.subheading} key={index}>
                        {index+1}-&nbsp;&nbsp;{titles}&nbsp;&nbsp;&nbsp;
                      </Text>
                    )}
                  </View>
                <View  style={{position: 'absolute', zIndex: 1, backgroundColor: 'white'}}>
                  <View> 
                   {this.state.contentControlling.filter((items,index)=>index>=(this.state.pgno-1)*15 && index<this.state.pgno*15).map((item,index)=><View key={index}>{item}</View>)}
                   
                  </View>
                </View>
              </View>
            </View>
            {(this.state.pgno !==0 ?<View style={{alignItems: 'center', marginTop: 2}}>
               <Text style={{textAlign: 'center', borderWidth: 1, borderRadius: 50, width: 35, display: 'flex'}}>{this.state.pgno}</Text>
            </View>: null)}
          </View>
        </GestureRecognizer>
      </Container>
    );
  }
  
};
const screenHeight = Math.round(Dimensions.get('window').height);
const styles = StyleSheet.create({
  heading: {
    fontSize: 26,
    textAlign: 'center',
    fontWeight: "bold",
    lineHeight: 28.1,
    marginTop: 7,
    marginBottom: 5,
    display: 'flex',
    fontFamily: '"Jameel Noori Nastaleeq","Alvi Nastaleeq","Pak Nastaleeq","Nafees Web Naskh","Urdu Naskh Asiatype",Tahoma,"Lucida Grande",Verdana,Arial,Sans-Serif',
  },
  subheading: {
    fontSize: 22,
    paddingRight: '4%',
    fontWeight: "bold",
    marginTop: '2.4%',
    lineHeight: 28.08,
    fontFamily: '"Jameel Noori Nastaleeq","Alvi Nastaleeq","Pak Nastaleeq","Nafees Web Naskh","Urdu Naskh Asiatype",Tahoma,"Lucida Grande",Verdana,Arial,Sans-Serif',
  },
  para: {
    fontSize: 19,
    paddingRight: '3%',
    paddingLeft: '1.5%',
    overflow: 'visible',
    lineHeight: 0.0431*(screenHeight),
    marginTop: 4,
    width: '100%',
    textAlign: 'right',
    fontFamily: '"Jameel Noori Nastaleeq","Alvi Nastaleeq","Pak Nastaleeq","Nafees Web Naskh","Urdu Naskh Asiatype",Tahoma,"Lucida Grande",Verdana,Arial,Sans-Serif',
  }
});

export default App;
